Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0xa3 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 2 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xaeeae): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x810f7): ../Core/Src/freertos.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x1f86e): C:/Users/samue/STM32CubeIDE/workspace_1.13.1/Assign2_Bissmann_Samuel/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 3 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 4
    <2c>   DW_AT_encoding    : 5	(signed)
    <2d>   DW_AT_name        : int
 <1><31>: Abbrev Number: 1 (DW_TAG_base_type)
    <32>   DW_AT_byte_size   : 4
    <33>   DW_AT_encoding    : 7	(unsigned)
    <34>   DW_AT_name        : (indirect string, offset: 0xf891): unsigned int
 <1><38>: Abbrev Number: 1 (DW_TAG_base_type)
    <39>   DW_AT_byte_size   : 8
    <3a>   DW_AT_encoding    : 5	(signed)
    <3b>   DW_AT_name        : (indirect string, offset: 0x56f74): long long int

    <86>   DW_AT_prototyped  : 1
    <86>   DW_AT_type        : <0x69>
    <8a>   DW_AT_low_pc      : 0x800057a
    <8e>   DW_AT_high_pc     : 0x10
    <92>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <94>   DW_AT_call_all_calls: 1
 <1><94>: Abbrev Number: 5 (DW_TAG_subprogram)
    <95>   DW_AT_external    : 1
    <95>   DW_AT_name        : (indirect string, offset: 0x55fcc): configureTimerForRunTimeStats
    <99>   DW_AT_decl_file   : 1
    <9a>   DW_AT_decl_line   : 61
    <9b>   DW_AT_decl_column : 13
    <9c>   DW_AT_prototyped  : 1
    <9c>   DW_AT_low_pc      : 0x800056c
    <a0>   DW_AT_high_pc     : 0xe
    <a4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a6>   DW_AT_call_all_calls: 1
 <1><a6>: Abbrev Number: 0
  Compilation Unit @ offset 0xa7:
   Length:        0x12db (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x60
   Pointer Size:  4
 <0><b3>: Abbrev Number: 31 (DW_TAG_compile_unit)
    <b4>   DW_AT_producer    : (indirect string, offset: 0xaeeae): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <b8>   DW_AT_language    : 29	(C11)
    <b9>   DW_AT_name        : (indirect string, offset: 0xc153e): ../Core/Src/main.c
    <bd>   DW_AT_comp_dir    : (indirect string, offset: 0x1f86e): C:/Users/samue/STM32CubeIDE/workspace_1.13.1/Assign2_Bissmann_Samuel/Debug
    <c1>   DW_AT_ranges      : 0x25
    <c5>   DW_AT_low_pc      : 0x0
    <c9>   DW_AT_stmt_list   : 0x951
    <cd>   DW_AT_macros      : 0x1e8ef
 <1><d1>: Abbrev Number: 9 (DW_TAG_base_type)
    <d2>   DW_AT_byte_size   : 1
    <d3>   DW_AT_encoding    : 6	(signed char)
    <d4>   DW_AT_name        : (indirect string, offset: 0x5f94b): signed char
 <1><d8>: Abbrev Number: 4 (DW_TAG_typedef)
    <d9>   DW_AT_name        : (indirect string, offset: 0xbeec5): __uint8_t
    <dd>   DW_AT_decl_file   : 3
    <de>   DW_AT_decl_line   : 43
    <df>   DW_AT_decl_column : 24
    <e0>   DW_AT_type        : <0xe4>
 <1><e4>: Abbrev Number: 9 (DW_TAG_base_type)
    <e5>   DW_AT_byte_size   : 1
    <e6>   DW_AT_encoding    : 8	(unsigned char)
    <e7>   DW_AT_name        : (indirect string, offset: 0xb676f): unsigned char
 <1><eb>: Abbrev Number: 9 (DW_TAG_base_type)
    <ec>   DW_AT_byte_size   : 2
    <ed>   DW_AT_encoding    : 5	(signed)
    <ee>   DW_AT_name        : (indirect string, offset: 0x8c9cf): short int
 <1><f2>: Abbrev Number: 4 (DW_TAG_typedef)
    <f3>   DW_AT_name        : (indirect string, offset: 0xc0f4b): __uint16_t
    <f7>   DW_AT_decl_file   : 3
    <f8>   DW_AT_decl_line   : 57
    <f9>   DW_AT_decl_column : 25
    <fa>   DW_AT_type        : <0xfe>
 <1><fe>: Abbrev Number: 9 (DW_TAG_base_type)
    <ff>   DW_AT_byte_size   : 2
    <100>   DW_AT_encoding    : 7	(unsigned)
    <101>   DW_AT_name        : (indirect string, offset: 0xb4f9b): short unsigned int
 <1><105>: Abbrev Number: 9 (DW_TAG_base_type)
    <106>   DW_AT_byte_size   : 4
    <107>   DW_AT_encoding    : 5	(signed)
    <108>   DW_AT_name        : (indirect string, offset: 0x10272): long int
 <1><10c>: Abbrev Number: 4 (DW_TAG_typedef)
    <10d>   DW_AT_name        : (indirect string, offset: 0xc042f): __uint32_t
    <111>   DW_AT_decl_file   : 3
    <112>   DW_AT_decl_line   : 79
    <113>   DW_AT_decl_column : 25
    <114>   DW_AT_type        : <0x118>
 <1><118>: Abbrev Number: 9 (DW_TAG_base_type)
    <119>   DW_AT_byte_size   : 4
    <11a>   DW_AT_encoding    : 7	(unsigned)
    <11b>   DW_AT_name        : (indirect string, offset: 0x48a20): long unsigned int
 <1><11f>: Abbrev Number: 9 (DW_TAG_base_type)
    <120>   DW_AT_byte_size   : 8
    <121>   DW_AT_encoding    : 5	(signed)
    <122>   DW_AT_name        : (indirect string, offset: 0x56f74): long long int
 <1><126>: Abbrev Number: 9 (DW_TAG_base_type)
    <127>   DW_AT_byte_size   : 8
    <128>   DW_AT_encoding    : 7	(unsigned)
    <129>   DW_AT_name        : (indirect string, offset: 0x27420): long long unsigned int
 <1><12d>: Abbrev Number: 32 (DW_TAG_base_type)
    <12e>   DW_AT_byte_size   : 4
    <12f>   DW_AT_encoding    : 5	(signed)
    <130>   DW_AT_name        : int
 <1><134>: Abbrev Number: 9 (DW_TAG_base_type)
    <135>   DW_AT_byte_size   : 4
    <136>   DW_AT_encoding    : 7	(unsigned)
    <137>   DW_AT_name        : (indirect string, offset: 0xf891): unsigned int
 <1><13b>: Abbrev Number: 4 (DW_TAG_typedef)
    <13c>   DW_AT_name        : (indirect string, offset: 0xbeec7): uint8_t
    <140>   DW_AT_decl_file   : 4
    <141>   DW_AT_decl_line   : 24
    <142>   DW_AT_decl_column : 19
    <143>   DW_AT_type        : <0xd8>
 <1><147>: Abbrev Number: 11 (DW_TAG_const_type)
    <148>   DW_AT_type        : <0x13b>
 <1><14c>: Abbrev Number: 4 (DW_TAG_typedef)
    <14d>   DW_AT_name        : (indirect string, offset: 0x89d30): uint16_t
    <151>   DW_AT_decl_file   : 4
    <152>   DW_AT_decl_line   : 36
    <153>   DW_AT_decl_column : 20
    <154>   DW_AT_type        : <0xf2>
 <1><158>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <159>   DW_AT_type        : <0x14c>
 <1><15d>: Abbrev Number: 4 (DW_TAG_typedef)
    <15e>   DW_AT_name        : (indirect string, offset: 0x89336): uint32_t
    <162>   DW_AT_decl_file   : 4
    <163>   DW_AT_decl_line   : 48
    <164>   DW_AT_decl_column : 20
    <165>   DW_AT_type        : <0x10c>
 <1><169>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <16a>   DW_AT_type        : <0x15d>
 <1><16e>: Abbrev Number: 19 (DW_TAG_structure_type)
    <16f>   DW_AT_byte_size   : 16
    <170>   DW_AT_decl_file   : 5
    <170>   DW_AT_decl_line   : 360
    <172>   DW_AT_decl_column : 9
    <172>   DW_AT_sibling     : <0x1ad>
 <2><176>: Abbrev Number: 8 (DW_TAG_member)
    <177>   DW_AT_name        : CCR
    <17b>   DW_AT_decl_file   : 5
    <17b>   DW_AT_decl_line   : 362
    <17d>   DW_AT_decl_column : 17
    <17d>   DW_AT_type        : <0x169>
    <181>   DW_AT_data_member_location: 0
 <2><182>: Abbrev Number: 3 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0xbef55): CNDTR
    <187>   DW_AT_decl_file   : 5
    <188>   DW_AT_decl_line   : 363
    <18a>   DW_AT_decl_column : 17
    <18b>   DW_AT_type        : <0x169>
    <18f>   DW_AT_data_member_location: 4
 <2><190>: Abbrev Number: 3 (DW_TAG_member)
    <191>   DW_AT_name        : (indirect string, offset: 0xc1c53): CPAR
    <195>   DW_AT_decl_file   : 5
    <196>   DW_AT_decl_line   : 364
    <198>   DW_AT_decl_column : 17
    <199>   DW_AT_type        : <0x169>
    <19d>   DW_AT_data_member_location: 8
 <2><19e>: Abbrev Number: 3 (DW_TAG_member)
    <19f>   DW_AT_name        : (indirect string, offset: 0xbff75): CMAR
    <1a3>   DW_AT_decl_file   : 5
    <1a4>   DW_AT_decl_line   : 365
    <1a6>   DW_AT_decl_column : 17
    <1a7>   DW_AT_type        : <0x169>
    <1ab>   DW_AT_data_member_location: 12
 <2><1ac>: Abbrev Number: 0
 <1><1ad>: Abbrev Number: 16 (DW_TAG_typedef)
    <1ae>   DW_AT_name        : (indirect string, offset: 0xc1a4e): DMA_Channel_TypeDef
    <1b2>   DW_AT_decl_file   : 5
    <1b3>   DW_AT_decl_line   : 366
    <1b5>   DW_AT_decl_column : 3
    <1b5>   DW_AT_type        : <0x16e>
 <1><1b9>: Abbrev Number: 19 (DW_TAG_structure_type)
    <1ba>   DW_AT_byte_size   : 8
    <1bb>   DW_AT_decl_file   : 5
    <1bb>   DW_AT_decl_line   : 368
    <1bd>   DW_AT_decl_column : 9
    <1bd>   DW_AT_sibling     : <0x1dc>
 <2><1c1>: Abbrev Number: 8 (DW_TAG_member)
    <1c2>   DW_AT_name        : ISR
    <1c6>   DW_AT_decl_file   : 5
    <1c6>   DW_AT_decl_line   : 370
    <1c8>   DW_AT_decl_column : 17
    <1c8>   DW_AT_type        : <0x169>
    <1cc>   DW_AT_data_member_location: 0
 <2><1cd>: Abbrev Number: 3 (DW_TAG_member)
    <1ce>   DW_AT_name        : (indirect string, offset: 0xc0932): IFCR
    <1d2>   DW_AT_decl_file   : 5
    <1d3>   DW_AT_decl_line   : 371
    <1d5>   DW_AT_decl_column : 17
    <1d6>   DW_AT_type        : <0x169>
    <1da>   DW_AT_data_member_location: 4
 <2><1db>: Abbrev Number: 0
 <1><1dc>: Abbrev Number: 16 (DW_TAG_typedef)
    <1dd>   DW_AT_name        : (indirect string, offset: 0xbf3be): DMA_TypeDef
    <1e1>   DW_AT_decl_file   : 5
    <1e2>   DW_AT_decl_line   : 372
    <1e4>   DW_AT_decl_column : 3
    <1e4>   DW_AT_type        : <0x1b9>
 <1><1e8>: Abbrev Number: 19 (DW_TAG_structure_type)
    <1e9>   DW_AT_byte_size   : 156
    <1ea>   DW_AT_decl_file   : 5
    <1ea>   DW_AT_decl_line   : 590
    <1ec>   DW_AT_decl_column : 9
    <1ec>   DW_AT_sibling     : <0x40e>
 <2><1f0>: Abbrev Number: 8 (DW_TAG_member)
    <1f1>   DW_AT_name        : CR
    <1f4>   DW_AT_decl_file   : 5
    <1f4>   DW_AT_decl_line   : 592
    <1f6>   DW_AT_decl_column : 17
    <1f6>   DW_AT_type        : <0x169>
    <1fa>   DW_AT_data_member_location: 0
 <2><1fb>: Abbrev Number: 3 (DW_TAG_member)
    <1fc>   DW_AT_name        : (indirect string, offset: 0xc075f): ICSCR
    <200>   DW_AT_decl_file   : 5
    <201>   DW_AT_decl_line   : 593
    <203>   DW_AT_decl_column : 17
    <204>   DW_AT_type        : <0x169>
    <208>   DW_AT_data_member_location: 4
 <2><209>: Abbrev Number: 3 (DW_TAG_member)
    <20a>   DW_AT_name        : (indirect string, offset: 0xbf1c4): CFGR
    <20e>   DW_AT_decl_file   : 5
    <20f>   DW_AT_decl_line   : 594
    <211>   DW_AT_decl_column : 17
    <212>   DW_AT_type        : <0x169>
    <216>   DW_AT_data_member_location: 8
 <2><217>: Abbrev Number: 3 (DW_TAG_member)
    <218>   DW_AT_name        : (indirect string, offset: 0xc0937): PLLCFGR
    <21c>   DW_AT_decl_file   : 5
    <21d>   DW_AT_decl_line   : 595
    <21f>   DW_AT_decl_column : 17
    <220>   DW_AT_type        : <0x169>
    <224>   DW_AT_data_member_location: 12
 <2><225>: Abbrev Number: 3 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0xbf1bd): PLLSAI1CFGR
    <22a>   DW_AT_decl_file   : 5
    <22b>   DW_AT_decl_line   : 596
    <22d>   DW_AT_decl_column : 17
    <22e>   DW_AT_type        : <0x169>
    <232>   DW_AT_data_member_location: 16
 <2><233>: Abbrev Number: 3 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0x72cb4): RESERVED
    <238>   DW_AT_decl_file   : 5
    <239>   DW_AT_decl_line   : 597
    <23b>   DW_AT_decl_column : 17
    <23c>   DW_AT_type        : <0x15d>
    <240>   DW_AT_data_member_location: 20
 <2><241>: Abbrev Number: 3 (DW_TAG_member)
    <242>   DW_AT_name        : (indirect string, offset: 0xbd92f): CIER
    <246>   DW_AT_decl_file   : 5
    <247>   DW_AT_decl_line   : 598
    <249>   DW_AT_decl_column : 17
    <24a>   DW_AT_type        : <0x169>
    <24e>   DW_AT_data_member_location: 24
 <2><24f>: Abbrev Number: 3 (DW_TAG_member)
    <250>   DW_AT_name        : (indirect string, offset: 0xbd934): CIFR
    <254>   DW_AT_decl_file   : 5
    <255>   DW_AT_decl_line   : 599
    <257>   DW_AT_decl_column : 17
    <258>   DW_AT_type        : <0x169>
    <25c>   DW_AT_data_member_location: 28
 <2><25d>: Abbrev Number: 3 (DW_TAG_member)
    <25e>   DW_AT_name        : (indirect string, offset: 0xbd918): CICR
    <262>   DW_AT_decl_file   : 5
    <263>   DW_AT_decl_line   : 600
    <265>   DW_AT_decl_column : 17
    <266>   DW_AT_type        : <0x169>
    <26a>   DW_AT_data_member_location: 32
 <2><26b>: Abbrev Number: 3 (DW_TAG_member)
    <26c>   DW_AT_name        : (indirect string, offset: 0xc1a08): RESERVED0
    <270>   DW_AT_decl_file   : 5
    <271>   DW_AT_decl_line   : 601
    <273>   DW_AT_decl_column : 17
    <274>   DW_AT_type        : <0x15d>
    <278>   DW_AT_data_member_location: 36
 <2><279>: Abbrev Number: 3 (DW_TAG_member)
    <27a>   DW_AT_name        : (indirect string, offset: 0xc0df4): AHB1RSTR
    <27e>   DW_AT_decl_file   : 5
    <27f>   DW_AT_decl_line   : 602
    <281>   DW_AT_decl_column : 17
    <282>   DW_AT_type        : <0x169>
    <286>   DW_AT_data_member_location: 40
 <2><287>: Abbrev Number: 3 (DW_TAG_member)
    <288>   DW_AT_name        : (indirect string, offset: 0xbe58e): AHB2RSTR
    <28c>   DW_AT_decl_file   : 5
    <28d>   DW_AT_decl_line   : 603
    <28f>   DW_AT_decl_column : 17
    <290>   DW_AT_type        : <0x169>
    <294>   DW_AT_data_member_location: 44
 <2><295>: Abbrev Number: 3 (DW_TAG_member)
    <296>   DW_AT_name        : (indirect string, offset: 0xbf66c): AHB3RSTR
    <29a>   DW_AT_decl_file   : 5
    <29b>   DW_AT_decl_line   : 604
    <29d>   DW_AT_decl_column : 17
    <29e>   DW_AT_type        : <0x169>
    <2a2>   DW_AT_data_member_location: 48
 <2><2a3>: Abbrev Number: 3 (DW_TAG_member)
    <2a4>   DW_AT_name        : (indirect string, offset: 0xc1a12): RESERVED1
    <2a8>   DW_AT_decl_file   : 5
    <2a9>   DW_AT_decl_line   : 605
    <2ab>   DW_AT_decl_column : 17
    <2ac>   DW_AT_type        : <0x15d>
    <2b0>   DW_AT_data_member_location: 52
 <2><2b1>: Abbrev Number: 3 (DW_TAG_member)
    <2b2>   DW_AT_name        : (indirect string, offset: 0xbe6a0): APB1RSTR1
    <2b6>   DW_AT_decl_file   : 5
    <2b7>   DW_AT_decl_line   : 606
    <2b9>   DW_AT_decl_column : 17
    <2ba>   DW_AT_type        : <0x169>
    <2be>   DW_AT_data_member_location: 56
 <2><2bf>: Abbrev Number: 3 (DW_TAG_member)
    <2c0>   DW_AT_name        : (indirect string, offset: 0xbe6aa): APB1RSTR2
    <2c4>   DW_AT_decl_file   : 5
    <2c5>   DW_AT_decl_line   : 607
    <2c7>   DW_AT_decl_column : 17
    <2c8>   DW_AT_type        : <0x169>
    <2cc>   DW_AT_data_member_location: 60
 <2><2cd>: Abbrev Number: 3 (DW_TAG_member)
    <2ce>   DW_AT_name        : (indirect string, offset: 0xbf663): APB2RSTR
    <2d2>   DW_AT_decl_file   : 5
    <2d3>   DW_AT_decl_line   : 608
    <2d5>   DW_AT_decl_column : 17
    <2d6>   DW_AT_type        : <0x169>
    <2da>   DW_AT_data_member_location: 64
 <2><2db>: Abbrev Number: 3 (DW_TAG_member)
    <2dc>   DW_AT_name        : (indirect string, offset: 0xc1a1c): RESERVED2
    <2e0>   DW_AT_decl_file   : 5
    <2e1>   DW_AT_decl_line   : 609
    <2e3>   DW_AT_decl_column : 17
    <2e4>   DW_AT_type        : <0x15d>
    <2e8>   DW_AT_data_member_location: 68
 <2><2e9>: Abbrev Number: 3 (DW_TAG_member)
    <2ea>   DW_AT_name        : (indirect string, offset: 0xbdc95): AHB1ENR
    <2ee>   DW_AT_decl_file   : 5
    <2ef>   DW_AT_decl_line   : 610
    <2f1>   DW_AT_decl_column : 17
    <2f2>   DW_AT_type        : <0x169>
    <2f6>   DW_AT_data_member_location: 72
 <2><2f7>: Abbrev Number: 3 (DW_TAG_member)
    <2f8>   DW_AT_name        : (indirect string, offset: 0xbeaeb): AHB2ENR
    <2fc>   DW_AT_decl_file   : 5
    <2fd>   DW_AT_decl_line   : 611
    <2ff>   DW_AT_decl_column : 17
    <300>   DW_AT_type        : <0x169>
    <304>   DW_AT_data_member_location: 76
 <2><305>: Abbrev Number: 3 (DW_TAG_member)
    <306>   DW_AT_name        : (indirect string, offset: 0xbf7ff): AHB3ENR
    <30a>   DW_AT_decl_file   : 5
    <30b>   DW_AT_decl_line   : 612
    <30d>   DW_AT_decl_column : 17
    <30e>   DW_AT_type        : <0x169>
    <312>   DW_AT_data_member_location: 80
 <2><313>: Abbrev Number: 3 (DW_TAG_member)
    <314>   DW_AT_name        : (indirect string, offset: 0xc1a26): RESERVED3
    <318>   DW_AT_decl_file   : 5
    <319>   DW_AT_decl_line   : 613
    <31b>   DW_AT_decl_column : 17
    <31c>   DW_AT_type        : <0x15d>
    <320>   DW_AT_data_member_location: 84
 <2><321>: Abbrev Number: 3 (DW_TAG_member)
    <322>   DW_AT_name        : (indirect string, offset: 0xbda24): APB1ENR1
    <326>   DW_AT_decl_file   : 5
    <327>   DW_AT_decl_line   : 614
    <329>   DW_AT_decl_column : 17
    <32a>   DW_AT_type        : <0x169>
    <32e>   DW_AT_data_member_location: 88
 <2><32f>: Abbrev Number: 3 (DW_TAG_member)
    <330>   DW_AT_name        : (indirect string, offset: 0xbda2d): APB1ENR2
    <334>   DW_AT_decl_file   : 5
    <335>   DW_AT_decl_line   : 615
    <337>   DW_AT_decl_column : 17
    <338>   DW_AT_type        : <0x169>
    <33c>   DW_AT_data_member_location: 92
 <2><33d>: Abbrev Number: 3 (DW_TAG_member)
    <33e>   DW_AT_name        : (indirect string, offset: 0xbdf29): APB2ENR
    <342>   DW_AT_decl_file   : 5
    <343>   DW_AT_decl_line   : 616
    <345>   DW_AT_decl_column : 17
    <346>   DW_AT_type        : <0x169>
    <34a>   DW_AT_data_member_location: 96
 <2><34b>: Abbrev Number: 3 (DW_TAG_member)
    <34c>   DW_AT_name        : (indirect string, offset: 0xc01dc): RESERVED4
    <350>   DW_AT_decl_file   : 5
    <351>   DW_AT_decl_line   : 617
    <353>   DW_AT_decl_column : 17
    <354>   DW_AT_type        : <0x15d>
    <358>   DW_AT_data_member_location: 100
 <2><359>: Abbrev Number: 3 (DW_TAG_member)
    <35a>   DW_AT_name        : (indirect string, offset: 0xbf931): AHB1SMENR
    <35e>   DW_AT_decl_file   : 5
    <35f>   DW_AT_decl_line   : 618
    <361>   DW_AT_decl_column : 17
    <362>   DW_AT_type        : <0x169>
    <366>   DW_AT_data_member_location: 104
 <2><367>: Abbrev Number: 3 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0xc17f9): AHB2SMENR
    <36c>   DW_AT_decl_file   : 5
    <36d>   DW_AT_decl_line   : 619
    <36f>   DW_AT_decl_column : 17
    <370>   DW_AT_type        : <0x169>
    <374>   DW_AT_data_member_location: 108
 <2><375>: Abbrev Number: 3 (DW_TAG_member)
    <376>   DW_AT_name        : (indirect string, offset: 0xbf3ca): AHB3SMENR
    <37a>   DW_AT_decl_file   : 5
    <37b>   DW_AT_decl_line   : 620
    <37d>   DW_AT_decl_column : 17
    <37e>   DW_AT_type        : <0x169>
    <382>   DW_AT_data_member_location: 112
 <2><383>: Abbrev Number: 3 (DW_TAG_member)
    <384>   DW_AT_name        : (indirect string, offset: 0xc1a30): RESERVED5
    <388>   DW_AT_decl_file   : 5
    <389>   DW_AT_decl_line   : 621
    <38b>   DW_AT_decl_column : 17
    <38c>   DW_AT_type        : <0x15d>
    <390>   DW_AT_data_member_location: 116
 <2><391>: Abbrev Number: 3 (DW_TAG_member)
    <392>   DW_AT_name        : (indirect string, offset: 0xbda51): APB1SMENR1
    <396>   DW_AT_decl_file   : 5
    <397>   DW_AT_decl_line   : 622
    <399>   DW_AT_decl_column : 17
    <39a>   DW_AT_type        : <0x169>
    <39e>   DW_AT_data_member_location: 120
 <2><39f>: Abbrev Number: 3 (DW_TAG_member)
    <3a0>   DW_AT_name        : (indirect string, offset: 0xbda5c): APB1SMENR2
    <3a4>   DW_AT_decl_file   : 5
    <3a5>   DW_AT_decl_line   : 623
    <3a7>   DW_AT_decl_column : 17
    <3a8>   DW_AT_type        : <0x169>
    <3ac>   DW_AT_data_member_location: 124
 <2><3ad>: Abbrev Number: 3 (DW_TAG_member)
    <3ae>   DW_AT_name        : (indirect string, offset: 0xc0e25): APB2SMENR
    <3b2>   DW_AT_decl_file   : 5
    <3b3>   DW_AT_decl_line   : 624
    <3b5>   DW_AT_decl_column : 17
    <3b6>   DW_AT_type        : <0x169>
    <3ba>   DW_AT_data_member_location: 128
 <2><3bb>: Abbrev Number: 3 (DW_TAG_member)
    <3bc>   DW_AT_name        : (indirect string, offset: 0xc1a3a): RESERVED6
    <3c0>   DW_AT_decl_file   : 5
    <3c1>   DW_AT_decl_line   : 625
    <3c3>   DW_AT_decl_column : 17
    <3c4>   DW_AT_type        : <0x15d>
    <3c8>   DW_AT_data_member_location: 132
 <2><3c9>: Abbrev Number: 3 (DW_TAG_member)
    <3ca>   DW_AT_name        : (indirect string, offset: 0xbefd2): CCIPR
    <3ce>   DW_AT_decl_file   : 5
    <3cf>   DW_AT_decl_line   : 626
    <3d1>   DW_AT_decl_column : 17
    <3d2>   DW_AT_type        : <0x169>
    <3d6>   DW_AT_data_member_location: 136
 <2><3d7>: Abbrev Number: 3 (DW_TAG_member)
    <3d8>   DW_AT_name        : (indirect string, offset: 0xc1a44): RESERVED7
    <3dc>   DW_AT_decl_file   : 5
    <3dd>   DW_AT_decl_line   : 627
    <3df>   DW_AT_decl_column : 17
    <3e0>   DW_AT_type        : <0x15d>
    <3e4>   DW_AT_data_member_location: 140
 <2><3e5>: Abbrev Number: 3 (DW_TAG_member)
    <3e6>   DW_AT_name        : (indirect string, offset: 0xbea24): BDCR
    <3ea>   DW_AT_decl_file   : 5
    <3eb>   DW_AT_decl_line   : 628
    <3ed>   DW_AT_decl_column : 17
    <3ee>   DW_AT_type        : <0x169>
    <3f2>   DW_AT_data_member_location: 144
 <2><3f3>: Abbrev Number: 8 (DW_TAG_member)
    <3f4>   DW_AT_name        : CSR
    <3f8>   DW_AT_decl_file   : 5
    <3f8>   DW_AT_decl_line   : 629
    <3fa>   DW_AT_decl_column : 17
    <3fa>   DW_AT_type        : <0x169>
    <3fe>   DW_AT_data_member_location: 148
 <2><3ff>: Abbrev Number: 3 (DW_TAG_member)
    <400>   DW_AT_name        : (indirect string, offset: 0xbebf1): CRRCR
    <404>   DW_AT_decl_file   : 5
    <405>   DW_AT_decl_line   : 630
    <407>   DW_AT_decl_column : 17
    <408>   DW_AT_type        : <0x169>
    <40c>   DW_AT_data_member_location: 152
 <2><40d>: Abbrev Number: 0
 <1><40e>: Abbrev Number: 16 (DW_TAG_typedef)
    <40f>   DW_AT_name        : (indirect string, offset: 0xbf980): RCC_TypeDef
    <413>   DW_AT_decl_file   : 5
    <414>   DW_AT_decl_line   : 631
    <416>   DW_AT_decl_column : 3
    <416>   DW_AT_type        : <0x1e8>
 <1><41a>: Abbrev Number: 19 (DW_TAG_structure_type)
    <41b>   DW_AT_byte_size   : 44
    <41c>   DW_AT_decl_file   : 5
    <41c>   DW_AT_decl_line   : 827
    <41e>   DW_AT_decl_column : 9
    <41e>   DW_AT_sibling     : <0x4e3>
 <2><422>: Abbrev Number: 8 (DW_TAG_member)
    <423>   DW_AT_name        : CR1
    <427>   DW_AT_decl_file   : 5
    <427>   DW_AT_decl_line   : 829
    <429>   DW_AT_decl_column : 17
    <429>   DW_AT_type        : <0x169>
    <42d>   DW_AT_data_member_location: 0
 <2><42e>: Abbrev Number: 8 (DW_TAG_member)
    <42f>   DW_AT_name        : CR2
    <433>   DW_AT_decl_file   : 5
    <433>   DW_AT_decl_line   : 830
    <435>   DW_AT_decl_column : 17
    <435>   DW_AT_type        : <0x169>
    <439>   DW_AT_data_member_location: 4
 <2><43a>: Abbrev Number: 8 (DW_TAG_member)
    <43b>   DW_AT_name        : CR3
    <43f>   DW_AT_decl_file   : 5
    <43f>   DW_AT_decl_line   : 831
    <441>   DW_AT_decl_column : 17
    <441>   DW_AT_type        : <0x169>
    <445>   DW_AT_data_member_location: 8
 <2><446>: Abbrev Number: 8 (DW_TAG_member)
    <447>   DW_AT_name        : BRR
    <44b>   DW_AT_decl_file   : 5
    <44b>   DW_AT_decl_line   : 832
    <44d>   DW_AT_decl_column : 17
    <44d>   DW_AT_type        : <0x169>
    <451>   DW_AT_data_member_location: 12
 <2><452>: Abbrev Number: 3 (DW_TAG_member)
    <453>   DW_AT_name        : (indirect string, offset: 0xbed04): GTPR
    <457>   DW_AT_decl_file   : 5
    <458>   DW_AT_decl_line   : 833
    <45a>   DW_AT_decl_column : 17
    <45b>   DW_AT_type        : <0x158>
    <45f>   DW_AT_data_member_location: 16
 <2><460>: Abbrev Number: 3 (DW_TAG_member)
    <461>   DW_AT_name        : (indirect string, offset: 0xc1a1c): RESERVED2
    <465>   DW_AT_decl_file   : 5
    <466>   DW_AT_decl_line   : 834
    <468>   DW_AT_decl_column : 13
    <469>   DW_AT_type        : <0x14c>
    <46d>   DW_AT_data_member_location: 18
 <2><46e>: Abbrev Number: 3 (DW_TAG_member)
    <46f>   DW_AT_name        : (indirect string, offset: 0xc01be): RTOR
    <473>   DW_AT_decl_file   : 5
    <474>   DW_AT_decl_line   : 835
    <476>   DW_AT_decl_column : 17
    <477>   DW_AT_type        : <0x169>
    <47b>   DW_AT_data_member_location: 20
 <2><47c>: Abbrev Number: 8 (DW_TAG_member)
    <47d>   DW_AT_name        : RQR
    <481>   DW_AT_decl_file   : 5
    <481>   DW_AT_decl_line   : 836
    <483>   DW_AT_decl_column : 17
    <483>   DW_AT_type        : <0x158>
    <487>   DW_AT_data_member_location: 24
 <2><488>: Abbrev Number: 3 (DW_TAG_member)
    <489>   DW_AT_name        : (indirect string, offset: 0xc1a26): RESERVED3
    <48d>   DW_AT_decl_file   : 5
    <48e>   DW_AT_decl_line   : 837
    <490>   DW_AT_decl_column : 13
    <491>   DW_AT_type        : <0x14c>
    <495>   DW_AT_data_member_location: 26
 <2><496>: Abbrev Number: 8 (DW_TAG_member)
    <497>   DW_AT_name        : ISR
    <49b>   DW_AT_decl_file   : 5
    <49b>   DW_AT_decl_line   : 838
    <49d>   DW_AT_decl_column : 17
    <49d>   DW_AT_type        : <0x169>
    <4a1>   DW_AT_data_member_location: 28
 <2><4a2>: Abbrev Number: 8 (DW_TAG_member)
    <4a3>   DW_AT_name        : ICR
    <4a7>   DW_AT_decl_file   : 5
    <4a7>   DW_AT_decl_line   : 839
    <4a9>   DW_AT_decl_column : 17
    <4a9>   DW_AT_type        : <0x169>
    <4ad>   DW_AT_data_member_location: 32
 <2><4ae>: Abbrev Number: 8 (DW_TAG_member)
    <4af>   DW_AT_name        : RDR
    <4b3>   DW_AT_decl_file   : 5
    <4b3>   DW_AT_decl_line   : 840
    <4b5>   DW_AT_decl_column : 17
    <4b5>   DW_AT_type        : <0x158>
    <4b9>   DW_AT_data_member_location: 36
 <2><4ba>: Abbrev Number: 3 (DW_TAG_member)
    <4bb>   DW_AT_name        : (indirect string, offset: 0xc01dc): RESERVED4
    <4bf>   DW_AT_decl_file   : 5
    <4c0>   DW_AT_decl_line   : 841
    <4c2>   DW_AT_decl_column : 13
    <4c3>   DW_AT_type        : <0x14c>
    <4c7>   DW_AT_data_member_location: 38
 <2><4c8>: Abbrev Number: 8 (DW_TAG_member)
    <4c9>   DW_AT_name        : TDR
    <4cd>   DW_AT_decl_file   : 5
    <4cd>   DW_AT_decl_line   : 842
    <4cf>   DW_AT_decl_column : 17
    <4cf>   DW_AT_type        : <0x158>
    <4d3>   DW_AT_data_member_location: 40
 <2><4d4>: Abbrev Number: 3 (DW_TAG_member)
    <4d5>   DW_AT_name        : (indirect string, offset: 0xc1a30): RESERVED5
    <4d9>   DW_AT_decl_file   : 5
    <4da>   DW_AT_decl_line   : 843
    <4dc>   DW_AT_decl_column : 13
    <4dd>   DW_AT_type        : <0x14c>
    <4e1>   DW_AT_data_member_location: 42
 <2><4e2>: Abbrev Number: 0
 <1><4e3>: Abbrev Number: 16 (DW_TAG_typedef)
    <4e4>   DW_AT_name        : (indirect string, offset: 0xc1df8): USART_TypeDef
    <4e8>   DW_AT_decl_file   : 5
    <4e9>   DW_AT_decl_line   : 844
    <4eb>   DW_AT_decl_column : 3
    <4eb>   DW_AT_type        : <0x41a>
 <1><4ef>: Abbrev Number: 9 (DW_TAG_base_type)
    <4f0>   DW_AT_byte_size   : 8
    <4f1>   DW_AT_encoding    : 4	(float)
    <4f2>   DW_AT_name        : (indirect string, offset: 0x11968): long double
 <1><4f6>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <4f7>   DW_AT_encoding    : 7	(unsigned)
    <4f8>   DW_AT_byte_size   : 1
    <4f9>   DW_AT_type        : <0xe4>
    <4fd>   DW_AT_decl_file   : 6
    <4fe>   DW_AT_decl_line   : 39
    <4ff>   DW_AT_decl_column : 1
    <500>   DW_AT_sibling     : <0x51d>
 <2><504>: Abbrev Number: 2 (DW_TAG_enumerator)
    <505>   DW_AT_name        : (indirect string, offset: 0xbf22c): HAL_OK
    <509>   DW_AT_const_value : 0
 <2><50a>: Abbrev Number: 2 (DW_TAG_enumerator)
    <50b>   DW_AT_name        : (indirect string, offset: 0xc0345): HAL_ERROR
    <50f>   DW_AT_const_value : 1
 <2><510>: Abbrev Number: 2 (DW_TAG_enumerator)
    <511>   DW_AT_name        : (indirect string, offset: 0xbe227): HAL_BUSY
    <515>   DW_AT_const_value : 2
 <2><516>: Abbrev Number: 2 (DW_TAG_enumerator)
    <517>   DW_AT_name        : (indirect string, offset: 0xbef04): HAL_TIMEOUT
    <51b>   DW_AT_const_value : 3
 <2><51c>: Abbrev Number: 0
 <1><51d>: Abbrev Number: 4 (DW_TAG_typedef)
    <51e>   DW_AT_name        : (indirect string, offset: 0xbd91d): HAL_StatusTypeDef
    <522>   DW_AT_decl_file   : 6
    <523>   DW_AT_decl_line   : 44
    <524>   DW_AT_decl_column : 3
    <525>   DW_AT_type        : <0x4f6>
 <1><529>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <52a>   DW_AT_encoding    : 7	(unsigned)
    <52b>   DW_AT_byte_size   : 1
    <52c>   DW_AT_type        : <0xe4>
    <530>   DW_AT_decl_file   : 6
    <531>   DW_AT_decl_line   : 50
    <532>   DW_AT_decl_column : 1
    <533>   DW_AT_sibling     : <0x544>
 <2><537>: Abbrev Number: 2 (DW_TAG_enumerator)
    <538>   DW_AT_name        : (indirect string, offset: 0xc0a76): HAL_UNLOCKED
    <53c>   DW_AT_const_value : 0
 <2><53d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <53e>   DW_AT_name        : (indirect string, offset: 0xc202d): HAL_LOCKED
    <542>   DW_AT_const_value : 1
 <2><543>: Abbrev Number: 0
 <1><544>: Abbrev Number: 4 (DW_TAG_typedef)
    <545>   DW_AT_name        : (indirect string, offset: 0xc01ae): HAL_LockTypeDef
    <549>   DW_AT_decl_file   : 6
    <54a>   DW_AT_decl_line   : 53
    <54b>   DW_AT_decl_column : 3
    <54c>   DW_AT_type        : <0x529>
 <1><550>: Abbrev Number: 10 (DW_TAG_structure_type)
    <551>   DW_AT_byte_size   : 28
    <552>   DW_AT_decl_file   : 7
    <553>   DW_AT_decl_line   : 45
    <554>   DW_AT_decl_column : 9
    <554>   DW_AT_sibling     : <0x5b4>
 <2><558>: Abbrev Number: 1 (DW_TAG_member)
    <559>   DW_AT_name        : (indirect string, offset: 0xc0714): PLLState
    <55d>   DW_AT_decl_file   : 7
    <55e>   DW_AT_decl_line   : 47
    <55f>   DW_AT_decl_column : 12
    <560>   DW_AT_type        : <0x15d>
    <564>   DW_AT_data_member_location: 0
 <2><565>: Abbrev Number: 1 (DW_TAG_member)
    <566>   DW_AT_name        : (indirect string, offset: 0xc0860): PLLSource
    <56a>   DW_AT_decl_file   : 7
    <56b>   DW_AT_decl_line   : 50
    <56c>   DW_AT_decl_column : 12
    <56d>   DW_AT_type        : <0x15d>
    <571>   DW_AT_data_member_location: 4
 <2><572>: Abbrev Number: 1 (DW_TAG_member)
    <573>   DW_AT_name        : (indirect string, offset: 0xc04f2): PLLM
    <577>   DW_AT_decl_file   : 7
    <578>   DW_AT_decl_line   : 53
    <579>   DW_AT_decl_column : 12
    <57a>   DW_AT_type        : <0x15d>
    <57e>   DW_AT_data_member_location: 8
 <2><57f>: Abbrev Number: 1 (DW_TAG_member)
    <580>   DW_AT_name        : (indirect string, offset: 0xc100d): PLLN
    <584>   DW_AT_decl_file   : 7
    <585>   DW_AT_decl_line   : 57
    <586>   DW_AT_decl_column : 12
    <587>   DW_AT_type        : <0x15d>
    <58b>   DW_AT_data_member_location: 12
 <2><58c>: Abbrev Number: 1 (DW_TAG_member)
    <58d>   DW_AT_name        : (indirect string, offset: 0xbde04): PLLP
    <591>   DW_AT_decl_file   : 7
    <592>   DW_AT_decl_line   : 61
    <593>   DW_AT_decl_column : 12
    <594>   DW_AT_type        : <0x15d>
    <598>   DW_AT_data_member_location: 16
 <2><599>: Abbrev Number: 1 (DW_TAG_member)
    <59a>   DW_AT_name        : (indirect string, offset: 0x46757): PLLQ
    <59e>   DW_AT_decl_file   : 7
    <59f>   DW_AT_decl_line   : 65
    <5a0>   DW_AT_decl_column : 12
    <5a1>   DW_AT_type        : <0x15d>
    <5a5>   DW_AT_data_member_location: 20
 <2><5a6>: Abbrev Number: 1 (DW_TAG_member)
    <5a7>   DW_AT_name        : (indirect string, offset: 0xc1012): PLLR
    <5ab>   DW_AT_decl_file   : 7
    <5ac>   DW_AT_decl_line   : 68
    <5ad>   DW_AT_decl_column : 12
    <5ae>   DW_AT_type        : <0x15d>
    <5b2>   DW_AT_data_member_location: 24
 <2><5b3>: Abbrev Number: 0
 <1><5b4>: Abbrev Number: 4 (DW_TAG_typedef)
    <5b5>   DW_AT_name        : (indirect string, offset: 0xc02a2): RCC_PLLInitTypeDef
    <5b9>   DW_AT_decl_file   : 7
    <5ba>   DW_AT_decl_line   : 73
    <5bb>   DW_AT_decl_column : 2
    <5bc>   DW_AT_type        : <0x550>
 <1><5c0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <5c1>   DW_AT_byte_size   : 68
    <5c2>   DW_AT_decl_file   : 7
    <5c3>   DW_AT_decl_line   : 78
    <5c4>   DW_AT_decl_column : 9
    <5c4>   DW_AT_sibling     : <0x658>
 <2><5c8>: Abbrev Number: 1 (DW_TAG_member)
    <5c9>   DW_AT_name        : (indirect string, offset: 0xc0f06): OscillatorType
    <5cd>   DW_AT_decl_file   : 7
    <5ce>   DW_AT_decl_line   : 80
    <5cf>   DW_AT_decl_column : 12
    <5d0>   DW_AT_type        : <0x15d>
    <5d4>   DW_AT_data_member_location: 0
 <2><5d5>: Abbrev Number: 1 (DW_TAG_member)
    <5d6>   DW_AT_name        : (indirect string, offset: 0xc07bc): HSEState
    <5da>   DW_AT_decl_file   : 7
    <5db>   DW_AT_decl_line   : 83
    <5dc>   DW_AT_decl_column : 12
    <5dd>   DW_AT_type        : <0x15d>
    <5e1>   DW_AT_data_member_location: 4
 <2><5e2>: Abbrev Number: 1 (DW_TAG_member)
    <5e3>   DW_AT_name        : (indirect string, offset: 0xc03e6): LSEState
    <5e7>   DW_AT_decl_file   : 7
    <5e8>   DW_AT_decl_line   : 86
    <5e9>   DW_AT_decl_column : 12
    <5ea>   DW_AT_type        : <0x15d>
    <5ee>   DW_AT_data_member_location: 8
 <2><5ef>: Abbrev Number: 1 (DW_TAG_member)
    <5f0>   DW_AT_name        : (indirect string, offset: 0xbf739): HSIState
    <5f4>   DW_AT_decl_file   : 7
    <5f5>   DW_AT_decl_line   : 89
    <5f6>   DW_AT_decl_column : 12
    <5f7>   DW_AT_type        : <0x15d>
    <5fb>   DW_AT_data_member_location: 12
 <2><5fc>: Abbrev Number: 1 (DW_TAG_member)
    <5fd>   DW_AT_name        : (indirect string, offset: 0xc12be): HSICalibrationValue
    <601>   DW_AT_decl_file   : 7
    <602>   DW_AT_decl_line   : 92
    <603>   DW_AT_decl_column : 12
    <604>   DW_AT_type        : <0x15d>
    <608>   DW_AT_data_member_location: 16
 <2><609>: Abbrev Number: 1 (DW_TAG_member)
    <60a>   DW_AT_name        : (indirect string, offset: 0xbf337): LSIState
    <60e>   DW_AT_decl_file   : 7
    <60f>   DW_AT_decl_line   : 98
    <610>   DW_AT_decl_column : 12
    <611>   DW_AT_type        : <0x15d>
    <615>   DW_AT_data_member_location: 20
 <2><616>: Abbrev Number: 1 (DW_TAG_member)
    <617>   DW_AT_name        : (indirect string, offset: 0xbf233): MSIState
    <61b>   DW_AT_decl_file   : 7
    <61c>   DW_AT_decl_line   : 106
    <61d>   DW_AT_decl_column : 12
    <61e>   DW_AT_type        : <0x15d>
    <622>   DW_AT_data_member_location: 24
 <2><623>: Abbrev Number: 1 (DW_TAG_member)
    <624>   DW_AT_name        : (indirect string, offset: 0xbefa8): MSICalibrationValue
    <628>   DW_AT_decl_file   : 7
    <629>   DW_AT_decl_line   : 109
    <62a>   DW_AT_decl_column : 12
    <62b>   DW_AT_type        : <0x15d>
    <62f>   DW_AT_data_member_location: 28
 <2><630>: Abbrev Number: 1 (DW_TAG_member)
    <631>   DW_AT_name        : (indirect string, offset: 0xbfbe9): MSIClockRange
    <635>   DW_AT_decl_file   : 7
    <636>   DW_AT_decl_line   : 112
    <637>   DW_AT_decl_column : 12
    <638>   DW_AT_type        : <0x15d>
    <63c>   DW_AT_data_member_location: 32
 <2><63d>: Abbrev Number: 1 (DW_TAG_member)
    <63e>   DW_AT_name        : (indirect string, offset: 0xc0997): HSI48State
    <642>   DW_AT_decl_file   : 7
    <643>   DW_AT_decl_line   : 115
    <644>   DW_AT_decl_column : 12
    <645>   DW_AT_type        : <0x15d>
    <649>   DW_AT_data_member_location: 36
 <2><64a>: Abbrev Number: 33 (DW_TAG_member)
    <64b>   DW_AT_name        : PLL
    <64f>   DW_AT_decl_file   : 7
    <650>   DW_AT_decl_line   : 118
    <651>   DW_AT_decl_column : 22
    <652>   DW_AT_type        : <0x5b4>
    <656>   DW_AT_data_member_location: 40
 <2><657>: Abbrev Number: 0
 <1><658>: Abbrev Number: 4 (DW_TAG_typedef)
    <659>   DW_AT_name        : (indirect string, offset: 0xbfd6a): RCC_OscInitTypeDef
    <65d>   DW_AT_decl_file   : 7
    <65e>   DW_AT_decl_line   : 120
    <65f>   DW_AT_decl_column : 2
    <660>   DW_AT_type        : <0x5c0>
 <1><664>: Abbrev Number: 10 (DW_TAG_structure_type)
    <665>   DW_AT_byte_size   : 20
    <666>   DW_AT_decl_file   : 7
    <667>   DW_AT_decl_line   : 125
    <668>   DW_AT_decl_column : 9
    <668>   DW_AT_sibling     : <0x6ae>
 <2><66c>: Abbrev Number: 1 (DW_TAG_member)
    <66d>   DW_AT_name        : (indirect string, offset: 0xbefd8): ClockType
    <671>   DW_AT_decl_file   : 7
    <672>   DW_AT_decl_line   : 127
    <673>   DW_AT_decl_column : 12
    <674>   DW_AT_type        : <0x15d>
    <678>   DW_AT_data_member_location: 0
 <2><679>: Abbrev Number: 1 (DW_TAG_member)
    <67a>   DW_AT_name        : (indirect string, offset: 0xc0295): SYSCLKSource
    <67e>   DW_AT_decl_file   : 7
    <67f>   DW_AT_decl_line   : 130
    <680>   DW_AT_decl_column : 12
    <681>   DW_AT_type        : <0x15d>
    <685>   DW_AT_data_member_location: 4
 <2><686>: Abbrev Number: 1 (DW_TAG_member)
    <687>   DW_AT_name        : (indirect string, offset: 0xc0fec): AHBCLKDivider
    <68b>   DW_AT_decl_file   : 7
    <68c>   DW_AT_decl_line   : 133
    <68d>   DW_AT_decl_column : 12
    <68e>   DW_AT_type        : <0x15d>
    <692>   DW_AT_data_member_location: 8
 <2><693>: Abbrev Number: 1 (DW_TAG_member)
    <694>   DW_AT_name        : (indirect string, offset: 0xbda8d): APB1CLKDivider
    <698>   DW_AT_decl_file   : 7
    <699>   DW_AT_decl_line   : 136
    <69a>   DW_AT_decl_column : 12
    <69b>   DW_AT_type        : <0x15d>
    <69f>   DW_AT_data_member_location: 12
 <2><6a0>: Abbrev Number: 1 (DW_TAG_member)
    <6a1>   DW_AT_name        : (indirect string, offset: 0xbf90c): APB2CLKDivider
    <6a5>   DW_AT_decl_file   : 7
    <6a6>   DW_AT_decl_line   : 139
    <6a7>   DW_AT_decl_column : 12
    <6a8>   DW_AT_type        : <0x15d>
    <6ac>   DW_AT_data_member_location: 16
 <2><6ad>: Abbrev Number: 0
 <1><6ae>: Abbrev Number: 4 (DW_TAG_typedef)
    <6af>   DW_AT_name        : (indirect string, offset: 0xbefe2): RCC_ClkInitTypeDef
    <6b3>   DW_AT_decl_file   : 7
    <6b4>   DW_AT_decl_line   : 142
    <6b5>   DW_AT_decl_column : 2
    <6b6>   DW_AT_type        : <0x664>
 <1><6ba>: Abbrev Number: 10 (DW_TAG_structure_type)
    <6bb>   DW_AT_byte_size   : 32
    <6bc>   DW_AT_decl_file   : 8
    <6bd>   DW_AT_decl_line   : 46
    <6be>   DW_AT_decl_column : 9
    <6be>   DW_AT_sibling     : <0x72b>
 <2><6c2>: Abbrev Number: 1 (DW_TAG_member)
    <6c3>   DW_AT_name        : (indirect string, offset: 0xc15c7): Request
    <6c7>   DW_AT_decl_file   : 8
    <6c8>   DW_AT_decl_line   : 48
    <6c9>   DW_AT_decl_column : 12
    <6ca>   DW_AT_type        : <0x15d>
    <6ce>   DW_AT_data_member_location: 0
 <2><6cf>: Abbrev Number: 1 (DW_TAG_member)
    <6d0>   DW_AT_name        : (indirect string, offset: 0xc5f69): Direction
    <6d4>   DW_AT_decl_file   : 8
    <6d5>   DW_AT_decl_line   : 51
    <6d6>   DW_AT_decl_column : 12
    <6d7>   DW_AT_type        : <0x15d>
    <6db>   DW_AT_data_member_location: 4
 <2><6dc>: Abbrev Number: 1 (DW_TAG_member)
    <6dd>   DW_AT_name        : (indirect string, offset: 0xbdc58): PeriphInc
    <6e1>   DW_AT_decl_file   : 8
    <6e2>   DW_AT_decl_line   : 55
    <6e3>   DW_AT_decl_column : 12
    <6e4>   DW_AT_type        : <0x15d>
    <6e8>   DW_AT_data_member_location: 8
 <2><6e9>: Abbrev Number: 1 (DW_TAG_member)
    <6ea>   DW_AT_name        : (indirect string, offset: 0xbe17d): MemInc
    <6ee>   DW_AT_decl_file   : 8
    <6ef>   DW_AT_decl_line   : 58
    <6f0>   DW_AT_decl_column : 12
    <6f1>   DW_AT_type        : <0x15d>
    <6f5>   DW_AT_data_member_location: 12
 <2><6f6>: Abbrev Number: 1 (DW_TAG_member)
    <6f7>   DW_AT_name        : (indirect string, offset: 0xbfaf0): PeriphDataAlignment
    <6fb>   DW_AT_decl_file   : 8
    <6fc>   DW_AT_decl_line   : 61
    <6fd>   DW_AT_decl_column : 12
    <6fe>   DW_AT_type        : <0x15d>
    <702>   DW_AT_data_member_location: 16
 <2><703>: Abbrev Number: 1 (DW_TAG_member)
    <704>   DW_AT_name        : (indirect string, offset: 0xc172f): MemDataAlignment
    <708>   DW_AT_decl_file   : 8
    <709>   DW_AT_decl_line   : 64
    <70a>   DW_AT_decl_column : 12
    <70b>   DW_AT_type        : <0x15d>
    <70f>   DW_AT_data_member_location: 20
 <2><710>: Abbrev Number: 1 (DW_TAG_member)
    <711>   DW_AT_name        : (indirect string, offset: 0xc5624): Mode
    <715>   DW_AT_decl_file   : 8
    <716>   DW_AT_decl_line   : 67
    <717>   DW_AT_decl_column : 12
    <718>   DW_AT_type        : <0x15d>
    <71c>   DW_AT_data_member_location: 24
 <2><71d>: Abbrev Number: 1 (DW_TAG_member)
    <71e>   DW_AT_name        : (indirect string, offset: 0xc4f0d): Priority
    <722>   DW_AT_decl_file   : 8
    <723>   DW_AT_decl_line   : 72
    <724>   DW_AT_decl_column : 12
    <725>   DW_AT_type        : <0x15d>
    <729>   DW_AT_data_member_location: 28
 <2><72a>: Abbrev Number: 0
 <1><72b>: Abbrev Number: 4 (DW_TAG_typedef)
    <72c>   DW_AT_name        : (indirect string, offset: 0xbebbf): DMA_InitTypeDef
    <730>   DW_AT_decl_file   : 8
    <731>   DW_AT_decl_line   : 74
    <732>   DW_AT_decl_column : 3
    <733>   DW_AT_type        : <0x6ba>
 <1><737>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <738>   DW_AT_encoding    : 7	(unsigned)
    <739>   DW_AT_byte_size   : 1
    <73a>   DW_AT_type        : <0xe4>
    <73e>   DW_AT_decl_file   : 8
    <73f>   DW_AT_decl_line   : 80
    <740>   DW_AT_decl_column : 1
    <741>   DW_AT_sibling     : <0x75e>
 <2><745>: Abbrev Number: 2 (DW_TAG_enumerator)
    <746>   DW_AT_name        : (indirect string, offset: 0xc0a9e): HAL_DMA_STATE_RESET
    <74a>   DW_AT_const_value : 0
 <2><74b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <74c>   DW_AT_name        : (indirect string, offset: 0xbebf7): HAL_DMA_STATE_READY
    <750>   DW_AT_const_value : 1
 <2><751>: Abbrev Number: 2 (DW_TAG_enumerator)
    <752>   DW_AT_name        : (indirect string, offset: 0xc084d): HAL_DMA_STATE_BUSY
    <756>   DW_AT_const_value : 2
 <2><757>: Abbrev Number: 2 (DW_TAG_enumerator)
    <758>   DW_AT_name        : (indirect string, offset: 0xc1d8f): HAL_DMA_STATE_TIMEOUT
    <75c>   DW_AT_const_value : 3
 <2><75d>: Abbrev Number: 0
 <1><75e>: Abbrev Number: 4 (DW_TAG_typedef)
    <75f>   DW_AT_name        : (indirect string, offset: 0xbff32): HAL_DMA_StateTypeDef
    <763>   DW_AT_decl_file   : 8
    <764>   DW_AT_decl_line   : 85
    <765>   DW_AT_decl_column : 3
    <766>   DW_AT_type        : <0x737>
 <1><76a>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <76b>   DW_AT_type        : <0x75e>
 <1><76f>: Abbrev Number: 25 (DW_TAG_structure_type)
    <770>   DW_AT_name        : (indirect string, offset: 0xc1261): __DMA_HandleTypeDef
    <774>   DW_AT_byte_size   : 72
    <775>   DW_AT_decl_file   : 8
    <776>   DW_AT_decl_line   : 112
    <777>   DW_AT_decl_column : 16
    <777>   DW_AT_sibling     : <0x818>
 <2><77b>: Abbrev Number: 1 (DW_TAG_member)
    <77c>   DW_AT_name        : (indirect string, offset: 0xc0f42): Instance
    <780>   DW_AT_decl_file   : 8
    <781>   DW_AT_decl_line   : 114
    <782>   DW_AT_decl_column : 27
    <783>   DW_AT_type        : <0x818>
    <787>   DW_AT_data_member_location: 0
 <2><788>: Abbrev Number: 1 (DW_TAG_member)
    <789>   DW_AT_name        : (indirect string, offset: 0xc5f5b): Init
    <78d>   DW_AT_decl_file   : 8
    <78e>   DW_AT_decl_line   : 116
    <78f>   DW_AT_decl_column : 25
    <790>   DW_AT_type        : <0x72b>
    <794>   DW_AT_data_member_location: 4
 <2><795>: Abbrev Number: 1 (DW_TAG_member)
    <796>   DW_AT_name        : (indirect string, offset: 0x869b6): Lock
    <79a>   DW_AT_decl_file   : 8
    <79b>   DW_AT_decl_line   : 118
    <79c>   DW_AT_decl_column : 25
    <79d>   DW_AT_type        : <0x544>
    <7a1>   DW_AT_data_member_location: 36
 <2><7a2>: Abbrev Number: 1 (DW_TAG_member)
    <7a3>   DW_AT_name        : (indirect string, offset: 0xc099c): State
    <7a7>   DW_AT_decl_file   : 8
    <7a8>   DW_AT_decl_line   : 120
    <7a9>   DW_AT_decl_column : 30
    <7aa>   DW_AT_type        : <0x76a>
    <7ae>   DW_AT_data_member_location: 37
 <2><7af>: Abbrev Number: 1 (DW_TAG_member)
    <7b0>   DW_AT_name        : (indirect string, offset: 0xc1b62): Parent
    <7b4>   DW_AT_decl_file   : 8
    <7b5>   DW_AT_decl_line   : 122
    <7b6>   DW_AT_decl_column : 26
    <7b7>   DW_AT_type        : <0x81d>
    <7bb>   DW_AT_data_member_location: 40
 <2><7bc>: Abbrev Number: 1 (DW_TAG_member)
    <7bd>   DW_AT_name        : (indirect string, offset: 0xc1e06): XferCpltCallback
    <7c1>   DW_AT_decl_file   : 8
    <7c2>   DW_AT_decl_line   : 124
    <7c3>   DW_AT_decl_column : 11
    <7c4>   DW_AT_type        : <0x82f>
    <7c8>   DW_AT_data_member_location: 44
 <2><7c9>: Abbrev Number: 1 (DW_TAG_member)
    <7ca>   DW_AT_name        : (indirect string, offset: 0xc0d62): XferHalfCpltCallback
    <7ce>   DW_AT_decl_file   : 8
    <7cf>   DW_AT_decl_line   : 126
    <7d0>   DW_AT_decl_column : 11
    <7d1>   DW_AT_type        : <0x82f>
    <7d5>   DW_AT_data_member_location: 48
 <2><7d6>: Abbrev Number: 1 (DW_TAG_member)
    <7d7>   DW_AT_name        : (indirect string, offset: 0xbe048): XferErrorCallback
    <7db>   DW_AT_decl_file   : 8
    <7dc>   DW_AT_decl_line   : 128
    <7dd>   DW_AT_decl_column : 11
    <7de>   DW_AT_type        : <0x82f>
    <7e2>   DW_AT_data_member_location: 52
 <2><7e3>: Abbrev Number: 1 (DW_TAG_member)
    <7e4>   DW_AT_name        : (indirect string, offset: 0xc18b8): XferAbortCallback
    <7e8>   DW_AT_decl_file   : 8
    <7e9>   DW_AT_decl_line   : 130
    <7ea>   DW_AT_decl_column : 11
    <7eb>   DW_AT_type        : <0x82f>
    <7ef>   DW_AT_data_member_location: 56
 <2><7f0>: Abbrev Number: 1 (DW_TAG_member)
    <7f1>   DW_AT_name        : (indirect string, offset: 0xc1d47): ErrorCode
    <7f5>   DW_AT_decl_file   : 8
    <7f6>   DW_AT_decl_line   : 132
    <7f7>   DW_AT_decl_column : 25
    <7f8>   DW_AT_type        : <0x169>
    <7fc>   DW_AT_data_member_location: 60
 <2><7fd>: Abbrev Number: 1 (DW_TAG_member)
    <7fe>   DW_AT_name        : (indirect string, offset: 0xbf526): DmaBaseAddress
    <802>   DW_AT_decl_file   : 8
    <803>   DW_AT_decl_line   : 134
    <804>   DW_AT_decl_column : 26
    <805>   DW_AT_type        : <0x834>
    <809>   DW_AT_data_member_location: 64
 <2><80a>: Abbrev Number: 1 (DW_TAG_member)
    <80b>   DW_AT_name        : (indirect string, offset: 0xbdc4b): ChannelIndex
    <80f>   DW_AT_decl_file   : 8
    <810>   DW_AT_decl_line   : 136
    <811>   DW_AT_decl_column : 25
    <812>   DW_AT_type        : <0x15d>
    <816>   DW_AT_data_member_location: 68
 <2><817>: Abbrev Number: 0
 <1><818>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <819>   DW_AT_byte_size   : 4
    <819>   DW_AT_type        : <0x1ad>
 <1><81d>: Abbrev Number: 34 (DW_TAG_pointer_type)
    <81e>   DW_AT_byte_size   : 4
 <1><81f>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <820>   DW_AT_prototyped  : 1
    <820>   DW_AT_sibling     : <0x82a>
 <2><824>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <825>   DW_AT_type        : <0x82a>
 <2><829>: Abbrev Number: 0
 <1><82a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <82b>   DW_AT_byte_size   : 4
    <82b>   DW_AT_type        : <0x76f>
 <1><82f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <830>   DW_AT_byte_size   : 4
    <830>   DW_AT_type        : <0x81f>
 <1><834>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <835>   DW_AT_byte_size   : 4
    <835>   DW_AT_type        : <0x1dc>
 <1><839>: Abbrev Number: 4 (DW_TAG_typedef)
    <83a>   DW_AT_name        : (indirect string, offset: 0xc1263): DMA_HandleTypeDef
    <83e>   DW_AT_decl_file   : 8
    <83f>   DW_AT_decl_line   : 153
    <840>   DW_AT_decl_column : 3
    <841>   DW_AT_type        : <0x76f>
 <1><845>: Abbrev Number: 10 (DW_TAG_structure_type)
    <846>   DW_AT_byte_size   : 32
    <847>   DW_AT_decl_file   : 9
    <848>   DW_AT_decl_line   : 46
    <849>   DW_AT_decl_column : 9
    <849>   DW_AT_sibling     : <0x8b6>
 <2><84d>: Abbrev Number: 1 (DW_TAG_member)
    <84e>   DW_AT_name        : (indirect string, offset: 0xc17e7): BaudRate
    <852>   DW_AT_decl_file   : 9
    <853>   DW_AT_decl_line   : 48
    <854>   DW_AT_decl_column : 12
    <855>   DW_AT_type        : <0x15d>
    <859>   DW_AT_data_member_location: 0
 <2><85a>: Abbrev Number: 1 (DW_TAG_member)
    <85b>   DW_AT_name        : (indirect string, offset: 0xbda19): WordLength
    <85f>   DW_AT_decl_file   : 9
    <860>   DW_AT_decl_line   : 68
    <861>   DW_AT_decl_column : 12
    <862>   DW_AT_type        : <0x15d>
    <866>   DW_AT_data_member_location: 4
 <2><867>: Abbrev Number: 1 (DW_TAG_member)
    <868>   DW_AT_name        : (indirect string, offset: 0xc17f0): StopBits
    <86c>   DW_AT_decl_file   : 9
    <86d>   DW_AT_decl_line   : 71
    <86e>   DW_AT_decl_column : 12
    <86f>   DW_AT_type        : <0x15d>
    <873>   DW_AT_data_member_location: 8
 <2><874>: Abbrev Number: 1 (DW_TAG_member)
    <875>   DW_AT_name        : (indirect string, offset: 0xbede8): Parity
    <879>   DW_AT_decl_file   : 9
    <87a>   DW_AT_decl_line   : 74
    <87b>   DW_AT_decl_column : 12
    <87c>   DW_AT_type        : <0x15d>
    <880>   DW_AT_data_member_location: 12
 <2><881>: Abbrev Number: 1 (DW_TAG_member)
    <882>   DW_AT_name        : (indirect string, offset: 0xc5624): Mode
    <886>   DW_AT_decl_file   : 9
    <887>   DW_AT_decl_line   : 81
    <888>   DW_AT_decl_column : 12
    <889>   DW_AT_type        : <0x15d>
    <88d>   DW_AT_data_member_location: 16
 <2><88e>: Abbrev Number: 1 (DW_TAG_member)
    <88f>   DW_AT_name        : (indirect string, offset: 0xbfdf7): HwFlowCtl
    <893>   DW_AT_decl_file   : 9
    <894>   DW_AT_decl_line   : 84
    <895>   DW_AT_decl_column : 12
    <896>   DW_AT_type        : <0x15d>
    <89a>   DW_AT_data_member_location: 20
 <2><89b>: Abbrev Number: 1 (DW_TAG_member)
    <89c>   DW_AT_name        : (indirect string, offset: 0xc1090): OverSampling
    <8a0>   DW_AT_decl_file   : 9
    <8a1>   DW_AT_decl_line   : 88
    <8a2>   DW_AT_decl_column : 12
    <8a3>   DW_AT_type        : <0x15d>
    <8a7>   DW_AT_data_member_location: 24
 <2><8a8>: Abbrev Number: 1 (DW_TAG_member)
    <8a9>   DW_AT_name        : (indirect string, offset: 0xbe691): OneBitSampling
    <8ad>   DW_AT_decl_file   : 9
    <8ae>   DW_AT_decl_line   : 92
    <8af>   DW_AT_decl_column : 12
    <8b0>   DW_AT_type        : <0x15d>
    <8b4>   DW_AT_data_member_location: 28
 <2><8b5>: Abbrev Number: 0
 <1><8b6>: Abbrev Number: 4 (DW_TAG_typedef)
    <8b7>   DW_AT_name        : (indirect string, offset: 0xbedb3): UART_InitTypeDef
    <8bb>   DW_AT_decl_file   : 9
    <8bc>   DW_AT_decl_line   : 101
    <8bd>   DW_AT_decl_column : 3
    <8be>   DW_AT_type        : <0x845>
 <1><8c2>: Abbrev Number: 10 (DW_TAG_structure_type)
    <8c3>   DW_AT_byte_size   : 40
    <8c4>   DW_AT_decl_file   : 9
    <8c5>   DW_AT_decl_line   : 106
    <8c6>   DW_AT_decl_column : 9
    <8c6>   DW_AT_sibling     : <0x94d>
 <2><8ca>: Abbrev Number: 1 (DW_TAG_member)
    <8cb>   DW_AT_name        : (indirect string, offset: 0xbe5f5): AdvFeatureInit
    <8cf>   DW_AT_decl_file   : 9
    <8d0>   DW_AT_decl_line   : 108
    <8d1>   DW_AT_decl_column : 12
    <8d2>   DW_AT_type        : <0x15d>
    <8d6>   DW_AT_data_member_location: 0
 <2><8d7>: Abbrev Number: 1 (DW_TAG_member)
    <8d8>   DW_AT_name        : (indirect string, offset: 0xc18a7): TxPinLevelInvert
    <8dc>   DW_AT_decl_file   : 9
    <8dd>   DW_AT_decl_line   : 113
    <8de>   DW_AT_decl_column : 12
    <8df>   DW_AT_type        : <0x15d>
    <8e3>   DW_AT_data_member_location: 4
 <2><8e4>: Abbrev Number: 1 (DW_TAG_member)
    <8e5>   DW_AT_name        : (indirect string, offset: 0xc109d): RxPinLevelInvert
    <8e9>   DW_AT_decl_file   : 9
    <8ea>   DW_AT_decl_line   : 116
    <8eb>   DW_AT_decl_column : 12
    <8ec>   DW_AT_type        : <0x15d>
    <8f0>   DW_AT_data_member_location: 8
 <2><8f1>: Abbrev Number: 1 (DW_TAG_member)
    <8f2>   DW_AT_name        : (indirect string, offset: 0xc078d): DataInvert
    <8f6>   DW_AT_decl_file   : 9
    <8f7>   DW_AT_decl_line   : 119
    <8f8>   DW_AT_decl_column : 12
    <8f9>   DW_AT_type        : <0x15d>
    <8fd>   DW_AT_data_member_location: 12
 <2><8fe>: Abbrev Number: 1 (DW_TAG_member)
    <8ff>   DW_AT_name        : (indirect string, offset: 0xbf0ce): Swap
    <903>   DW_AT_decl_file   : 9
    <904>   DW_AT_decl_line   : 123
    <905>   DW_AT_decl_column : 12
    <906>   DW_AT_type        : <0x15d>
    <90a>   DW_AT_data_member_location: 16
 <2><90b>: Abbrev Number: 1 (DW_TAG_member)
    <90c>   DW_AT_name        : (indirect string, offset: 0xbe604): OverrunDisable
    <910>   DW_AT_decl_file   : 9
    <911>   DW_AT_decl_line   : 126
    <912>   DW_AT_decl_column : 12
    <913>   DW_AT_type        : <0x15d>
    <917>   DW_AT_data_member_location: 20
 <2><918>: Abbrev Number: 1 (DW_TAG_member)
    <919>   DW_AT_name        : (indirect string, offset: 0xbda36): DMADisableonRxError
    <91d>   DW_AT_decl_file   : 9
    <91e>   DW_AT_decl_line   : 129
    <91f>   DW_AT_decl_column : 12
    <920>   DW_AT_type        : <0x15d>
    <924>   DW_AT_data_member_location: 24
 <2><925>: Abbrev Number: 1 (DW_TAG_member)
    <926>   DW_AT_name        : (indirect string, offset: 0xc176a): AutoBaudRateEnable
    <92a>   DW_AT_decl_file   : 9
    <92b>   DW_AT_decl_line   : 132
    <92c>   DW_AT_decl_column : 12
    <92d>   DW_AT_type        : <0x15d>
    <931>   DW_AT_data_member_location: 28
 <2><932>: Abbrev Number: 1 (DW_TAG_member)
    <933>   DW_AT_name        : (indirect string, offset: 0xc1242): AutoBaudRateMode
    <937>   DW_AT_decl_file   : 9
    <938>   DW_AT_decl_line   : 135
    <939>   DW_AT_decl_column : 12
    <93a>   DW_AT_type        : <0x15d>
    <93e>   DW_AT_data_member_location: 32
 <2><93f>: Abbrev Number: 1 (DW_TAG_member)
    <940>   DW_AT_name        : (indirect string, offset: 0xbf6ef): MSBFirst
    <944>   DW_AT_decl_file   : 9
    <945>   DW_AT_decl_line   : 139
    <946>   DW_AT_decl_column : 12
    <947>   DW_AT_type        : <0x15d>
    <94b>   DW_AT_data_member_location: 36
 <2><94c>: Abbrev Number: 0
 <1><94d>: Abbrev Number: 4 (DW_TAG_typedef)
    <94e>   DW_AT_name        : (indirect string, offset: 0xc0a83): UART_AdvFeatureInitTypeDef
    <952>   DW_AT_decl_file   : 9
    <953>   DW_AT_decl_line   : 141
    <954>   DW_AT_decl_column : 3
    <955>   DW_AT_type        : <0x8c2>
 <1><959>: Abbrev Number: 4 (DW_TAG_typedef)
    <95a>   DW_AT_name        : (indirect string, offset: 0xbefbc): HAL_UART_StateTypeDef
    <95e>   DW_AT_decl_file   : 9
    <95f>   DW_AT_decl_line   : 183
    <960>   DW_AT_decl_column : 18
    <961>   DW_AT_type        : <0x15d>
 <1><965>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <966>   DW_AT_type        : <0x959>
 <1><96a>: Abbrev Number: 4 (DW_TAG_typedef)
    <96b>   DW_AT_name        : (indirect string, offset: 0xbf53c): HAL_UART_RxTypeTypeDef
    <96f>   DW_AT_decl_file   : 9
    <970>   DW_AT_decl_line   : 207
    <971>   DW_AT_decl_column : 18
    <972>   DW_AT_type        : <0x15d>
 <1><976>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <977>   DW_AT_type        : <0x96a>
 <1><97b>: Abbrev Number: 4 (DW_TAG_typedef)
    <97c>   DW_AT_name        : (indirect string, offset: 0xbdf95): HAL_UART_RxEventTypeTypeDef
    <980>   DW_AT_decl_file   : 9
    <981>   DW_AT_decl_line   : 218
    <982>   DW_AT_decl_column : 18
    <983>   DW_AT_type        : <0x15d>
 <1><987>: Abbrev Number: 15 (DW_TAG_volatile_type)
    <988>   DW_AT_type        : <0x97b>
 <1><98c>: Abbrev Number: 25 (DW_TAG_structure_type)
    <98d>   DW_AT_name        : (indirect string, offset: 0xc0157): __UART_HandleTypeDef
    <991>   DW_AT_byte_size   : 136
    <992>   DW_AT_decl_file   : 9
    <993>   DW_AT_decl_line   : 223
    <994>   DW_AT_decl_column : 16
    <994>   DW_AT_sibling     : <0xaa6>
 <2><998>: Abbrev Number: 1 (DW_TAG_member)
    <999>   DW_AT_name        : (indirect string, offset: 0xc0f42): Instance
    <99d>   DW_AT_decl_file   : 9
    <99e>   DW_AT_decl_line   : 225
    <99f>   DW_AT_decl_column : 29
    <9a0>   DW_AT_type        : <0xaa6>
    <9a4>   DW_AT_data_member_location: 0
 <2><9a5>: Abbrev Number: 1 (DW_TAG_member)
    <9a6>   DW_AT_name        : (indirect string, offset: 0xc5f5b): Init
    <9aa>   DW_AT_decl_file   : 9
    <9ab>   DW_AT_decl_line   : 227
    <9ac>   DW_AT_decl_column : 28
    <9ad>   DW_AT_type        : <0x8b6>
    <9b1>   DW_AT_data_member_location: 4
 <2><9b2>: Abbrev Number: 1 (DW_TAG_member)
    <9b3>   DW_AT_name        : (indirect string, offset: 0xc0d85): AdvancedInit
    <9b7>   DW_AT_decl_file   : 9
    <9b8>   DW_AT_decl_line   : 229
    <9b9>   DW_AT_decl_column : 30
    <9ba>   DW_AT_type        : <0x94d>
    <9be>   DW_AT_data_member_location: 36
 <2><9bf>: Abbrev Number: 1 (DW_TAG_member)
    <9c0>   DW_AT_name        : (indirect string, offset: 0xbfa13): pTxBuffPtr
    <9c4>   DW_AT_decl_file   : 9
    <9c5>   DW_AT_decl_line   : 231
    <9c6>   DW_AT_decl_column : 29
    <9c7>   DW_AT_type        : <0xaab>
    <9cb>   DW_AT_data_member_location: 76
 <2><9cc>: Abbrev Number: 1 (DW_TAG_member)
    <9cd>   DW_AT_name        : (indirect string, offset: 0xbf61b): TxXferSize
    <9d1>   DW_AT_decl_file   : 9
    <9d2>   DW_AT_decl_line   : 233
    <9d3>   DW_AT_decl_column : 28
    <9d4>   DW_AT_type        : <0x14c>
    <9d8>   DW_AT_data_member_location: 80
 <2><9d9>: Abbrev Number: 1 (DW_TAG_member)
    <9da>   DW_AT_name        : (indirect string, offset: 0xbfa5e): TxXferCount
    <9de>   DW_AT_decl_file   : 9
    <9df>   DW_AT_decl_line   : 235
    <9e0>   DW_AT_decl_column : 28
    <9e1>   DW_AT_type        : <0x158>
    <9e5>   DW_AT_data_member_location: 82
 <2><9e6>: Abbrev Number: 1 (DW_TAG_member)
    <9e7>   DW_AT_name        : (indirect string, offset: 0xc1881): pRxBuffPtr
    <9eb>   DW_AT_decl_file   : 9
    <9ec>   DW_AT_decl_line   : 237
    <9ed>   DW_AT_decl_column : 29
    <9ee>   DW_AT_type        : <0xab0>
    <9f2>   DW_AT_data_member_location: 84
 <2><9f3>: Abbrev Number: 1 (DW_TAG_member)
    <9f4>   DW_AT_name        : (indirect string, offset: 0xbfb04): RxXferSize
    <9f8>   DW_AT_decl_file   : 9
    <9f9>   DW_AT_decl_line   : 239
    <9fa>   DW_AT_decl_column : 28
    <9fb>   DW_AT_type        : <0x14c>
    <9ff>   DW_AT_data_member_location: 88
 <2><a00>: Abbrev Number: 1 (DW_TAG_member)
    <a01>   DW_AT_name        : (indirect string, offset: 0xc0289): RxXferCount
    <a05>   DW_AT_decl_file   : 9
    <a06>   DW_AT_decl_line   : 241
    <a07>   DW_AT_decl_column : 28
    <a08>   DW_AT_type        : <0x158>
    <a0c>   DW_AT_data_member_location: 90
 <2><a0d>: Abbrev Number: 1 (DW_TAG_member)
    <a0e>   DW_AT_name        : (indirect string, offset: 0xc6059): Mask
    <a12>   DW_AT_decl_file   : 9
    <a13>   DW_AT_decl_line   : 243
    <a14>   DW_AT_decl_column : 28
    <a15>   DW_AT_type        : <0x14c>
    <a19>   DW_AT_data_member_location: 92
 <2><a1a>: Abbrev Number: 1 (DW_TAG_member)
    <a1b>   DW_AT_name        : (indirect string, offset: 0xc1065): ReceptionType
    <a1f>   DW_AT_decl_file   : 9
    <a20>   DW_AT_decl_line   : 254
    <a21>   DW_AT_decl_column : 31
    <a22>   DW_AT_type        : <0x976>
    <a26>   DW_AT_data_member_location: 96
 <2><a27>: Abbrev Number: 3 (DW_TAG_member)
    <a28>   DW_AT_name        : (indirect string, offset: 0xbdc73): RxEventType
    <a2c>   DW_AT_decl_file   : 9
    <a2d>   DW_AT_decl_line   : 256
    <a2f>   DW_AT_decl_column : 36
    <a30>   DW_AT_type        : <0x987>
    <a34>   DW_AT_data_member_location: 100
 <2><a35>: Abbrev Number: 3 (DW_TAG_member)
    <a36>   DW_AT_name        : (indirect string, offset: 0xc12ff): RxISR
    <a3a>   DW_AT_decl_file   : 9
    <a3b>   DW_AT_decl_line   : 258
    <a3d>   DW_AT_decl_column : 10
    <a3e>   DW_AT_type        : <0xac5>
    <a42>   DW_AT_data_member_location: 104
 <2><a43>: Abbrev Number: 3 (DW_TAG_member)
    <a44>   DW_AT_name        : (indirect string, offset: 0xbfb23): TxISR
    <a48>   DW_AT_decl_file   : 9
    <a49>   DW_AT_decl_line   : 260
    <a4b>   DW_AT_decl_column : 10
    <a4c>   DW_AT_type        : <0xac5>
    <a50>   DW_AT_data_member_location: 108
 <2><a51>: Abbrev Number: 3 (DW_TAG_member)
    <a52>   DW_AT_name        : (indirect string, offset: 0xc0fc0): hdmatx
    <a56>   DW_AT_decl_file   : 9
    <a57>   DW_AT_decl_line   : 262
    <a59>   DW_AT_decl_column : 29
    <a5a>   DW_AT_type        : <0xaca>
    <a5e>   DW_AT_data_member_location: 112
 <2><a5f>: Abbrev Number: 3 (DW_TAG_member)
    <a60>   DW_AT_name        : (indirect string, offset: 0xc1c6b): hdmarx
    <a64>   DW_AT_decl_file   : 9
    <a65>   DW_AT_decl_line   : 264
    <a67>   DW_AT_decl_column : 29
    <a68>   DW_AT_type        : <0xaca>
    <a6c>   DW_AT_data_member_location: 116
 <2><a6d>: Abbrev Number: 3 (DW_TAG_member)
    <a6e>   DW_AT_name        : (indirect string, offset: 0x869b6): Lock
    <a72>   DW_AT_decl_file   : 9
    <a73>   DW_AT_decl_line   : 266
    <a75>   DW_AT_decl_column : 29
    <a76>   DW_AT_type        : <0x544>
    <a7a>   DW_AT_data_member_location: 120
 <2><a7b>: Abbrev Number: 3 (DW_TAG_member)
    <a7c>   DW_AT_name        : (indirect string, offset: 0xbf535): gState
    <a80>   DW_AT_decl_file   : 9
    <a81>   DW_AT_decl_line   : 268
    <a83>   DW_AT_decl_column : 33
    <a84>   DW_AT_type        : <0x965>
    <a88>   DW_AT_data_member_location: 124
 <2><a89>: Abbrev Number: 3 (DW_TAG_member)
    <a8a>   DW_AT_name        : (indirect string, offset: 0xc1615): RxState
    <a8e>   DW_AT_decl_file   : 9
    <a8f>   DW_AT_decl_line   : 272
    <a91>   DW_AT_decl_column : 33
    <a92>   DW_AT_type        : <0x965>
    <a96>   DW_AT_data_member_location: 128
 <2><a97>: Abbrev Number: 3 (DW_TAG_member)
    <a98>   DW_AT_name        : (indirect string, offset: 0xc1d47): ErrorCode
    <a9c>   DW_AT_decl_file   : 9
    <a9d>   DW_AT_decl_line   : 275
    <a9f>   DW_AT_decl_column : 33
    <aa0>   DW_AT_type        : <0x169>
    <aa4>   DW_AT_data_member_location: 132
 <2><aa5>: Abbrev Number: 0
 <1><aa6>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <aa7>   DW_AT_byte_size   : 4
    <aa7>   DW_AT_type        : <0x4e3>
 <1><aab>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <aac>   DW_AT_byte_size   : 4
    <aac>   DW_AT_type        : <0x147>
 <1><ab0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ab1>   DW_AT_byte_size   : 4
    <ab1>   DW_AT_type        : <0x13b>
 <1><ab5>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <ab6>   DW_AT_prototyped  : 1
    <ab6>   DW_AT_sibling     : <0xac0>
 <2><aba>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <abb>   DW_AT_type        : <0xac0>
 <2><abf>: Abbrev Number: 0
 <1><ac0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ac1>   DW_AT_byte_size   : 4
    <ac1>   DW_AT_type        : <0x98c>
 <1><ac5>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ac6>   DW_AT_byte_size   : 4
    <ac6>   DW_AT_type        : <0xab5>
 <1><aca>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <acb>   DW_AT_byte_size   : 4
    <acb>   DW_AT_type        : <0x839>
 <1><acf>: Abbrev Number: 16 (DW_TAG_typedef)
    <ad0>   DW_AT_name        : (indirect string, offset: 0xc0159): UART_HandleTypeDef
    <ad4>   DW_AT_decl_file   : 9
    <ad5>   DW_AT_decl_line   : 297
    <ad7>   DW_AT_decl_column : 3
    <ad7>   DW_AT_type        : <0x98c>
 <1><adb>: Abbrev Number: 11 (DW_TAG_const_type)
    <adc>   DW_AT_type        : <0xacf>
 <1><ae0>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <ae1>   DW_AT_byte_size   : 4
    <ae1>   DW_AT_type        : <0xae5>
 <1><ae5>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <ae6>   DW_AT_prototyped  : 1
    <ae6>   DW_AT_sibling     : <0xaf0>
 <2><aea>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <aeb>   DW_AT_type        : <0x81d>
 <2><aef>: Abbrev Number: 0
 <1><af0>: Abbrev Number: 4 (DW_TAG_typedef)
    <af1>   DW_AT_name        : (indirect string, offset: 0xc1817): BaseType_t
    <af5>   DW_AT_decl_file   : 10
    <af6>   DW_AT_decl_line   : 56
    <af7>   DW_AT_decl_column : 14
    <af8>   DW_AT_type        : <0x105>
 <1><afc>: Abbrev Number: 11 (DW_TAG_const_type)
    <afd>   DW_AT_type        : <0xaf0>
 <1><b01>: Abbrev Number: 4 (DW_TAG_typedef)
    <b02>   DW_AT_name        : (indirect string, offset: 0xc1816): UBaseType_t
    <b06>   DW_AT_decl_file   : 10
    <b07>   DW_AT_decl_line   : 57
    <b08>   DW_AT_decl_column : 23
    <b09>   DW_AT_type        : <0x118>
 <1><b0d>: Abbrev Number: 11 (DW_TAG_const_type)
    <b0e>   DW_AT_type        : <0xb01>
 <1><b12>: Abbrev Number: 4 (DW_TAG_typedef)
    <b13>   DW_AT_name        : (indirect string, offset: 0x68db4): TickType_t
    <b17>   DW_AT_decl_file   : 10
    <b18>   DW_AT_decl_line   : 63
    <b19>   DW_AT_decl_column : 19
    <b1a>   DW_AT_type        : <0x15d>
 <1><b1e>: Abbrev Number: 9 (DW_TAG_base_type)
    <b1f>   DW_AT_byte_size   : 1
    <b20>   DW_AT_encoding    : 8	(unsigned char)
    <b21>   DW_AT_name        : (indirect string, offset: 0x3d0cf): char
 <1><b25>: Abbrev Number: 11 (DW_TAG_const_type)
    <b26>   DW_AT_type        : <0xb1e>
 <1><b2a>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <b2b>   DW_AT_byte_size   : 4
    <b2b>   DW_AT_type        : <0xb25>
 <1><b2f>: Abbrev Number: 26 (DW_TAG_array_type)
    <b30>   DW_AT_type        : <0x13b>
    <b34>   DW_AT_sibling     : <0xb3f>
 <2><b38>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <b39>   DW_AT_type        : <0x134>
    <b3d>   DW_AT_upper_bound : 1
 <2><b3e>: Abbrev Number: 0
 <1><b3f>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <b40>   DW_AT_encoding    : 5	(signed)
    <b41>   DW_AT_byte_size   : 4
    <b42>   DW_AT_type        : <0x12d>
    <b46>   DW_AT_decl_file   : 11
    <b47>   DW_AT_decl_line   : 82
    <b48>   DW_AT_decl_column : 14
    <b49>   DW_AT_sibling     : <0xc8b>
 <2><b4d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b4e>   DW_AT_name        : (indirect string, offset: 0xbef46): osPriorityNone
    <b52>   DW_AT_const_value : 0
 <2><b53>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b54>   DW_AT_name        : (indirect string, offset: 0xc13f0): osPriorityIdle
    <b58>   DW_AT_const_value : 1
 <2><b59>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b5a>   DW_AT_name        : (indirect string, offset: 0xc1873): osPriorityLow
    <b5e>   DW_AT_const_value : 8
 <2><b5f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b60>   DW_AT_name        : (indirect string, offset: 0xc1b04): osPriorityLow1
    <b64>   DW_AT_const_value : 9
 <2><b65>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b66>   DW_AT_name        : (indirect string, offset: 0xc1b13): osPriorityLow2
    <b6a>   DW_AT_const_value : 10
 <2><b6b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b6c>   DW_AT_name        : (indirect string, offset: 0xbf44b): osPriorityLow3
    <b70>   DW_AT_const_value : 11
 <2><b71>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b72>   DW_AT_name        : (indirect string, offset: 0xc1b22): osPriorityLow4
    <b76>   DW_AT_const_value : 12
 <2><b77>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b78>   DW_AT_name        : (indirect string, offset: 0xc1b31): osPriorityLow5
    <b7c>   DW_AT_const_value : 13
 <2><b7d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b7e>   DW_AT_name        : (indirect string, offset: 0xc1b40): osPriorityLow6
    <b82>   DW_AT_const_value : 14
 <2><b83>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b84>   DW_AT_name        : (indirect string, offset: 0xc0e04): osPriorityLow7
    <b88>   DW_AT_const_value : 15
 <2><b89>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b8a>   DW_AT_name        : (indirect string, offset: 0xc1be6): osPriorityBelowNormal
    <b8e>   DW_AT_const_value : 16
 <2><b8f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b90>   DW_AT_name        : (indirect string, offset: 0xc07c5): osPriorityBelowNormal1
    <b94>   DW_AT_const_value : 17
 <2><b95>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b96>   DW_AT_name        : (indirect string, offset: 0xc10d8): osPriorityBelowNormal2
    <b9a>   DW_AT_const_value : 18
 <2><b9b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <b9c>   DW_AT_name        : (indirect string, offset: 0xc0272): osPriorityBelowNormal3
    <ba0>   DW_AT_const_value : 19
 <2><ba1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ba2>   DW_AT_name        : (indirect string, offset: 0xc0cb4): osPriorityBelowNormal4
    <ba6>   DW_AT_const_value : 20
 <2><ba7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <ba8>   DW_AT_name        : (indirect string, offset: 0xc10ef): osPriorityBelowNormal5
    <bac>   DW_AT_const_value : 21
 <2><bad>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bae>   DW_AT_name        : (indirect string, offset: 0xc1106): osPriorityBelowNormal6
    <bb2>   DW_AT_const_value : 22
 <2><bb3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bb4>   DW_AT_name        : (indirect string, offset: 0xc0ccb): osPriorityBelowNormal7
    <bb8>   DW_AT_const_value : 23
 <2><bb9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bba>   DW_AT_name        : (indirect string, offset: 0xc0f15): osPriorityNormal
    <bbe>   DW_AT_const_value : 24
 <2><bbf>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bc0>   DW_AT_name        : (indirect string, offset: 0xbe193): osPriorityNormal1
    <bc4>   DW_AT_const_value : 25
 <2><bc5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bc6>   DW_AT_name        : (indirect string, offset: 0xbe1a5): osPriorityNormal2
    <bca>   DW_AT_const_value : 26
 <2><bcb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bcc>   DW_AT_name        : (indirect string, offset: 0xbe1b7): osPriorityNormal3
    <bd0>   DW_AT_const_value : 27
 <2><bd1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bd2>   DW_AT_name        : (indirect string, offset: 0xbe1c9): osPriorityNormal4
    <bd6>   DW_AT_const_value : 28
 <2><bd7>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bd8>   DW_AT_name        : (indirect string, offset: 0xbe1db): osPriorityNormal5
    <bdc>   DW_AT_const_value : 29
 <2><bdd>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bde>   DW_AT_name        : (indirect string, offset: 0xbf340): osPriorityNormal6
    <be2>   DW_AT_const_value : 30
 <2><be3>: Abbrev Number: 2 (DW_TAG_enumerator)
    <be4>   DW_AT_name        : (indirect string, offset: 0xbe1ed): osPriorityNormal7
    <be8>   DW_AT_const_value : 31
 <2><be9>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bea>   DW_AT_name        : (indirect string, offset: 0xc0474): osPriorityAboveNormal
    <bee>   DW_AT_const_value : 32
 <2><bef>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bf0>   DW_AT_name        : (indirect string, offset: 0xc1e6f): osPriorityAboveNormal1
    <bf4>   DW_AT_const_value : 33
 <2><bf5>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bf6>   DW_AT_name        : (indirect string, offset: 0xc1e86): osPriorityAboveNormal2
    <bfa>   DW_AT_const_value : 34
 <2><bfb>: Abbrev Number: 2 (DW_TAG_enumerator)
    <bfc>   DW_AT_name        : (indirect string, offset: 0xc1e9d): osPriorityAboveNormal3
    <c00>   DW_AT_const_value : 35
 <2><c01>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c02>   DW_AT_name        : (indirect string, offset: 0xc1eb4): osPriorityAboveNormal4
    <c06>   DW_AT_const_value : 36
 <2><c07>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c08>   DW_AT_name        : (indirect string, offset: 0xc14c1): osPriorityAboveNormal5
    <c0c>   DW_AT_const_value : 37
 <2><c0d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c0e>   DW_AT_name        : (indirect string, offset: 0xc1ecb): osPriorityAboveNormal6
    <c12>   DW_AT_const_value : 38
 <2><c13>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c14>   DW_AT_name        : (indirect string, offset: 0xc1ee2): osPriorityAboveNormal7
    <c18>   DW_AT_const_value : 39
 <2><c19>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c1a>   DW_AT_name        : (indirect string, offset: 0xbf38f): osPriorityHigh
    <c1e>   DW_AT_const_value : 40
 <2><c1f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c20>   DW_AT_name        : (indirect string, offset: 0xc06a4): osPriorityHigh1
    <c24>   DW_AT_const_value : 41
 <2><c25>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c26>   DW_AT_name        : (indirect string, offset: 0xc06b4): osPriorityHigh2
    <c2a>   DW_AT_const_value : 42
 <2><c2b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c2c>   DW_AT_name        : (indirect string, offset: 0xc06c4): osPriorityHigh3
    <c30>   DW_AT_const_value : 43
 <2><c31>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c32>   DW_AT_name        : (indirect string, offset: 0xc06d4): osPriorityHigh4
    <c36>   DW_AT_const_value : 44
 <2><c37>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c38>   DW_AT_name        : (indirect string, offset: 0xbd976): osPriorityHigh5
    <c3c>   DW_AT_const_value : 45
 <2><c3d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c3e>   DW_AT_name        : (indirect string, offset: 0xc06e4): osPriorityHigh6
    <c42>   DW_AT_const_value : 46
 <2><c43>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c44>   DW_AT_name        : (indirect string, offset: 0xc06f4): osPriorityHigh7
    <c48>   DW_AT_const_value : 47
 <2><c49>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c4a>   DW_AT_name        : (indirect string, offset: 0xc177d): osPriorityRealtime
    <c4e>   DW_AT_const_value : 48
 <2><c4f>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c50>   DW_AT_name        : (indirect string, offset: 0xc034f): osPriorityRealtime1
    <c54>   DW_AT_const_value : 49
 <2><c55>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c56>   DW_AT_name        : (indirect string, offset: 0xc0363): osPriorityRealtime2
    <c5a>   DW_AT_const_value : 50
 <2><c5b>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c5c>   DW_AT_name        : (indirect string, offset: 0xc0377): osPriorityRealtime3
    <c60>   DW_AT_const_value : 51
 <2><c61>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c62>   DW_AT_name        : (indirect string, offset: 0xc038b): osPriorityRealtime4
    <c66>   DW_AT_const_value : 52
 <2><c67>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c68>   DW_AT_name        : (indirect string, offset: 0xc039f): osPriorityRealtime5
    <c6c>   DW_AT_const_value : 53
 <2><c6d>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c6e>   DW_AT_name        : (indirect string, offset: 0xc03b3): osPriorityRealtime6
    <c72>   DW_AT_const_value : 54
 <2><c73>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c74>   DW_AT_name        : (indirect string, offset: 0xc03c7): osPriorityRealtime7
    <c78>   DW_AT_const_value : 55
 <2><c79>: Abbrev Number: 2 (DW_TAG_enumerator)
    <c7a>   DW_AT_name        : (indirect string, offset: 0xbd903): osPriorityISR
    <c7e>   DW_AT_const_value : 56
 <2><c7f>: Abbrev Number: 12 (DW_TAG_enumerator)
    <c80>   DW_AT_name        : (indirect string, offset: 0xc14b1): osPriorityError
    <c84>   DW_AT_const_value : -1
 <2><c85>: Abbrev Number: 28 (DW_TAG_enumerator)
    <c86>   DW_AT_name        : (indirect string, offset: 0xc1b4f): osPriorityReserved
    <c8a>   DW_AT_const_value : 2147483647
 <2><c8a>: Abbrev Number: 0
 <1><c8b>: Abbrev Number: 4 (DW_TAG_typedef)
    <c8c>   DW_AT_name        : (indirect string, offset: 0xbf1e6): osPriority_t
    <c90>   DW_AT_decl_file   : 11
    <c91>   DW_AT_decl_line   : 136
    <c92>   DW_AT_decl_column : 3
    <c93>   DW_AT_type        : <0xb3f>
 <1><c97>: Abbrev Number: 4 (DW_TAG_typedef)
    <c98>   DW_AT_name        : (indirect string, offset: 0xbfe47): osThreadFunc_t
    <c9c>   DW_AT_decl_file   : 11
    <c9d>   DW_AT_decl_line   : 139
    <c9e>   DW_AT_decl_column : 16
    <c9f>   DW_AT_type        : <0xae0>
 <1><ca3>: Abbrev Number: 17 (DW_TAG_enumeration_type)
    <ca4>   DW_AT_encoding    : 5	(signed)
    <ca5>   DW_AT_byte_size   : 4
    <ca6>   DW_AT_type        : <0x12d>
    <caa>   DW_AT_decl_file   : 11
    <cab>   DW_AT_decl_line   : 176
    <cac>   DW_AT_decl_column : 14
    <cad>   DW_AT_sibling     : <0xce1>
 <2><cb1>: Abbrev Number: 2 (DW_TAG_enumerator)
    <cb2>   DW_AT_name        : (indirect string, offset: 0xc0d1c): osOK
    <cb6>   DW_AT_const_value : 0
 <2><cb7>: Abbrev Number: 12 (DW_TAG_enumerator)
    <cb8>   DW_AT_name        : (indirect string, offset: 0xbf978): osError
    <cbc>   DW_AT_const_value : -1
 <2><cbd>: Abbrev Number: 12 (DW_TAG_enumerator)
    <cbe>   DW_AT_name        : (indirect string, offset: 0xbf583): osErrorTimeout
    <cc2>   DW_AT_const_value : -2
 <2><cc3>: Abbrev Number: 12 (DW_TAG_enumerator)
    <cc4>   DW_AT_name        : (indirect string, offset: 0xc05ee): osErrorResource
    <cc8>   DW_AT_const_value : -3
 <2><cc9>: Abbrev Number: 12 (DW_TAG_enumerator)
    <cca>   DW_AT_name        : (indirect string, offset: 0xbea29): osErrorParameter
    <cce>   DW_AT_const_value : -4
 <2><ccf>: Abbrev Number: 12 (DW_TAG_enumerator)
    <cd0>   DW_AT_name        : (indirect string, offset: 0xbe207): osErrorNoMemory
    <cd4>   DW_AT_const_value : -5
 <2><cd5>: Abbrev Number: 12 (DW_TAG_enumerator)
    <cd6>   DW_AT_name        : (indirect string, offset: 0xbebe6): osErrorISR
    <cda>   DW_AT_const_value : -6
 <2><cdb>: Abbrev Number: 28 (DW_TAG_enumerator)
    <cdc>   DW_AT_name        : (indirect string, offset: 0xbfb72): osStatusReserved
    <ce0>   DW_AT_const_value : 2147483647
 <2><ce0>: Abbrev Number: 0
 <1><ce1>: Abbrev Number: 4 (DW_TAG_typedef)
    <ce2>   DW_AT_name        : (indirect string, offset: 0xbf23c): osStatus_t
    <ce6>   DW_AT_decl_file   : 11
    <ce7>   DW_AT_decl_line   : 185
    <ce8>   DW_AT_decl_column : 3
    <ce9>   DW_AT_type        : <0xca3>
 <1><ced>: Abbrev Number: 4 (DW_TAG_typedef)
    <cee>   DW_AT_name        : (indirect string, offset: 0xc0668): osThreadId_t
    <cf2>   DW_AT_decl_file   : 11
    <cf3>   DW_AT_decl_line   : 189
    <cf4>   DW_AT_decl_column : 15
    <cf5>   DW_AT_type        : <0x81d>
 <1><cf9>: Abbrev Number: 4 (DW_TAG_typedef)
    <cfa>   DW_AT_name        : (indirect string, offset: 0xc0d01): osSemaphoreId_t
    <cfe>   DW_AT_decl_file   : 11
    <cff>   DW_AT_decl_line   : 201
    <d00>   DW_AT_decl_column : 15
    <d01>   DW_AT_type        : <0x81d>
 <1><d05>: Abbrev Number: 4 (DW_TAG_typedef)
    <d06>   DW_AT_name        : (indirect string, offset: 0xc0738): TZ_ModuleId_t
    <d0a>   DW_AT_decl_file   : 11
    <d0b>   DW_AT_decl_line   : 213
    <d0c>   DW_AT_decl_column : 18
    <d0d>   DW_AT_type        : <0x15d>
 <1><d11>: Abbrev Number: 10 (DW_TAG_structure_type)
    <d12>   DW_AT_byte_size   : 36
    <d13>   DW_AT_decl_file   : 11
    <d14>   DW_AT_decl_line   : 218
    <d15>   DW_AT_decl_column : 9
    <d15>   DW_AT_sibling     : <0xd8f>
 <2><d19>: Abbrev Number: 1 (DW_TAG_member)
    <d1a>   DW_AT_name        : (indirect string, offset: 0xbdf16): name
    <d1e>   DW_AT_decl_file   : 11
    <d1f>   DW_AT_decl_line   : 219
    <d20>   DW_AT_decl_column : 33
    <d21>   DW_AT_type        : <0xb2a>
    <d25>   DW_AT_data_member_location: 0
 <2><d26>: Abbrev Number: 1 (DW_TAG_member)
    <d27>   DW_AT_name        : (indirect string, offset: 0xc05e4): attr_bits
    <d2b>   DW_AT_decl_file   : 11
    <d2c>   DW_AT_decl_line   : 220
    <d2d>   DW_AT_decl_column : 28
    <d2e>   DW_AT_type        : <0x15d>
    <d32>   DW_AT_data_member_location: 4
 <2><d33>: Abbrev Number: 1 (DW_TAG_member)
    <d34>   DW_AT_name        : (indirect string, offset: 0xbe5ee): cb_mem
    <d38>   DW_AT_decl_file   : 11
    <d39>   DW_AT_decl_line   : 221
    <d3a>   DW_AT_decl_column : 30
    <d3b>   DW_AT_type        : <0x81d>
    <d3f>   DW_AT_data_member_location: 8
 <2><d40>: Abbrev Number: 1 (DW_TAG_member)
    <d41>   DW_AT_name        : (indirect string, offset: 0xc1a62): cb_size
    <d45>   DW_AT_decl_file   : 11
    <d46>   DW_AT_decl_line   : 222
    <d47>   DW_AT_decl_column : 30
    <d48>   DW_AT_type        : <0x15d>
    <d4c>   DW_AT_data_member_location: 12
 <2><d4d>: Abbrev Number: 1 (DW_TAG_member)
    <d4e>   DW_AT_name        : (indirect string, offset: 0xc17dd): stack_mem
    <d52>   DW_AT_decl_file   : 11
    <d53>   DW_AT_decl_line   : 223
    <d54>   DW_AT_decl_column : 27
    <d55>   DW_AT_type        : <0x81d>
    <d59>   DW_AT_data_member_location: 16
 <2><d5a>: Abbrev Number: 1 (DW_TAG_member)
    <d5b>   DW_AT_name        : (indirect string, offset: 0xc03db): stack_size
    <d5f>   DW_AT_decl_file   : 11
    <d60>   DW_AT_decl_line   : 224
    <d61>   DW_AT_decl_column : 27
    <d62>   DW_AT_type        : <0x15d>
    <d66>   DW_AT_data_member_location: 20
 <2><d67>: Abbrev Number: 1 (DW_TAG_member)
    <d68>   DW_AT_name        : (indirect string, offset: 0xbf501): priority
    <d6c>   DW_AT_decl_file   : 11
    <d6d>   DW_AT_decl_line   : 225
    <d6e>   DW_AT_decl_column : 29
    <d6f>   DW_AT_type        : <0xc8b>
    <d73>   DW_AT_data_member_location: 24
 <2><d74>: Abbrev Number: 1 (DW_TAG_member)
    <d75>   DW_AT_name        : (indirect string, offset: 0xbf64e): tz_module
    <d79>   DW_AT_decl_file   : 11
    <d7a>   DW_AT_decl_line   : 226
    <d7b>   DW_AT_decl_column : 28
    <d7c>   DW_AT_type        : <0xd05>
    <d80>   DW_AT_data_member_location: 28
 <2><d81>: Abbrev Number: 1 (DW_TAG_member)
    <d82>   DW_AT_name        : (indirect string, offset: 0xc15cf): reserved
    <d86>   DW_AT_decl_file   : 11
    <d87>   DW_AT_decl_line   : 227
    <d88>   DW_AT_decl_column : 29
    <d89>   DW_AT_type        : <0x15d>
    <d8d>   DW_AT_data_member_location: 32
 <2><d8e>: Abbrev Number: 0
 <1><d8f>: Abbrev Number: 4 (DW_TAG_typedef)
    <d90>   DW_AT_name        : (indirect string, offset: 0xbe184): osThreadAttr_t
    <d94>   DW_AT_decl_file   : 11
    <d95>   DW_AT_decl_line   : 228
    <d96>   DW_AT_decl_column : 3
    <d97>   DW_AT_type        : <0xd11>
 <1><d9b>: Abbrev Number: 11 (DW_TAG_const_type)
    <d9c>   DW_AT_type        : <0xd8f>
 <1><da0>: Abbrev Number: 10 (DW_TAG_structure_type)
    <da1>   DW_AT_byte_size   : 16
    <da2>   DW_AT_decl_file   : 11
    <da3>   DW_AT_decl_line   : 255
    <da4>   DW_AT_decl_column : 9
    <da4>   DW_AT_sibling     : <0xde1>
 <2><da8>: Abbrev Number: 3 (DW_TAG_member)
    <da9>   DW_AT_name        : (indirect string, offset: 0xbdf16): name
    <dad>   DW_AT_decl_file   : 11
    <dae>   DW_AT_decl_line   : 256
    <db0>   DW_AT_decl_column : 33
    <db1>   DW_AT_type        : <0xb2a>
    <db5>   DW_AT_data_member_location: 0
 <2><db6>: Abbrev Number: 3 (DW_TAG_member)
    <db7>   DW_AT_name        : (indirect string, offset: 0xc05e4): attr_bits
    <dbb>   DW_AT_decl_file   : 11
    <dbc>   DW_AT_decl_line   : 257
    <dbe>   DW_AT_decl_column : 28
    <dbf>   DW_AT_type        : <0x15d>
    <dc3>   DW_AT_data_member_location: 4
 <2><dc4>: Abbrev Number: 3 (DW_TAG_member)
    <dc5>   DW_AT_name        : (indirect string, offset: 0xbe5ee): cb_mem
    <dc9>   DW_AT_decl_file   : 11
    <dca>   DW_AT_decl_line   : 258
    <dcc>   DW_AT_decl_column : 30
    <dcd>   DW_AT_type        : <0x81d>
    <dd1>   DW_AT_data_member_location: 8
 <2><dd2>: Abbrev Number: 3 (DW_TAG_member)
    <dd3>   DW_AT_name        : (indirect string, offset: 0xc1a62): cb_size
    <dd7>   DW_AT_decl_file   : 11
    <dd8>   DW_AT_decl_line   : 259
    <dda>   DW_AT_decl_column : 30
    <ddb>   DW_AT_type        : <0x15d>
    <ddf>   DW_AT_data_member_location: 12
 <2><de0>: Abbrev Number: 0
 <1><de1>: Abbrev Number: 16 (DW_TAG_typedef)
    <de2>   DW_AT_name        : (indirect string, offset: 0xbe8a9): osSemaphoreAttr_t
    <de6>   DW_AT_decl_file   : 11
    <de7>   DW_AT_decl_line   : 260
    <de9>   DW_AT_decl_column : 3
    <de9>   DW_AT_type        : <0xda0>
 <1><ded>: Abbrev Number: 11 (DW_TAG_const_type)
    <dee>   DW_AT_type        : <0xde1>
 <1><df2>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <df3>   DW_AT_byte_size   : 4
    <df3>   DW_AT_type        : <0xdfc>
 <1><df7>: Abbrev Number: 11 (DW_TAG_const_type)
    <df8>   DW_AT_type        : <0xdf2>
 <1><dfc>: Abbrev Number: 35 (DW_TAG_const_type)
 <1><dfd>: Abbrev Number: 4 (DW_TAG_typedef)
    <dfe>   DW_AT_name        : (indirect string, offset: 0x43f06): QueueHandle_t
    <e02>   DW_AT_decl_file   : 12
    <e03>   DW_AT_decl_line   : 48
    <e04>   DW_AT_decl_column : 34
    <e05>   DW_AT_type        : <0xe0e>
 <1><e09>: Abbrev Number: 11 (DW_TAG_const_type)
    <e0a>   DW_AT_type        : <0xdfd>
 <1><e0e>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <e0f>   DW_AT_byte_size   : 4
    <e0f>   DW_AT_type        : <0xe13>
 <1><e13>: Abbrev Number: 36 (DW_TAG_structure_type)
    <e14>   DW_AT_name        : (indirect string, offset: 0xc0704): QueueDefinition
    <e18>   DW_AT_declaration : 1
 <1><e18>: Abbrev Number: 4 (DW_TAG_typedef)
    <e19>   DW_AT_name        : (indirect string, offset: 0x46121): SemaphoreHandle_t
    <e1d>   DW_AT_decl_file   : 13
    <e1e>   DW_AT_decl_line   : 37
    <e1f>   DW_AT_decl_column : 23
    <e20>   DW_AT_type        : <0xdfd>
 <1><e24>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e25>   DW_AT_byte_size   : 8
    <e26>   DW_AT_decl_file   : 1
    <e27>   DW_AT_decl_line   : 36
    <e28>   DW_AT_decl_column : 9
    <e28>   DW_AT_sibling     : <0xe47>
 <2><e2c>: Abbrev Number: 1 (DW_TAG_member)
    <e2d>   DW_AT_name        : (indirect string, offset: 0xc680f): data
    <e31>   DW_AT_decl_file   : 1
    <e32>   DW_AT_decl_line   : 37
    <e33>   DW_AT_decl_column : 6
    <e34>   DW_AT_type        : <0x12d>
    <e38>   DW_AT_data_member_location: 0
 <2><e39>: Abbrev Number: 1 (DW_TAG_member)
    <e3a>   DW_AT_name        : (indirect string, offset: 0xbe9bd): producer_task
    <e3e>   DW_AT_decl_file   : 1
    <e3f>   DW_AT_decl_line   : 38
    <e40>   DW_AT_decl_column : 15
    <e41>   DW_AT_type        : <0xced>
    <e45>   DW_AT_data_member_location: 4
 <2><e46>: Abbrev Number: 0
 <1><e47>: Abbrev Number: 4 (DW_TAG_typedef)
    <e48>   DW_AT_name        : (indirect string, offset: 0xbe1ff): rb_elem
    <e4c>   DW_AT_decl_file   : 1
    <e4d>   DW_AT_decl_line   : 40
    <e4e>   DW_AT_decl_column : 1
    <e4f>   DW_AT_type        : <0xe24>
 <1><e53>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e54>   DW_AT_byte_size   : 96
    <e55>   DW_AT_decl_file   : 1
    <e56>   DW_AT_decl_line   : 42
    <e57>   DW_AT_decl_column : 9
    <e57>   DW_AT_sibling     : <0xe9d>
 <2><e5b>: Abbrev Number: 1 (DW_TAG_member)
    <e5c>   DW_AT_name        : (indirect string, offset: 0xbe176): buffer
    <e60>   DW_AT_decl_file   : 1
    <e61>   DW_AT_decl_line   : 43
    <e62>   DW_AT_decl_column : 10
    <e63>   DW_AT_type        : <0xe9d>
    <e67>   DW_AT_data_member_location: 0
 <2><e68>: Abbrev Number: 1 (DW_TAG_member)
    <e69>   DW_AT_name        : (indirect string, offset: 0xc151e): mutex
    <e6d>   DW_AT_decl_file   : 1
    <e6e>   DW_AT_decl_line   : 44
    <e6f>   DW_AT_decl_column : 20
    <e70>   DW_AT_type        : <0xe18>
    <e74>   DW_AT_data_member_location: 80
 <2><e75>: Abbrev Number: 1 (DW_TAG_member)
    <e76>   DW_AT_name        : (indirect string, offset: 0xc7e0d): items
    <e7a>   DW_AT_decl_file   : 1
    <e7b>   DW_AT_decl_line   : 45
    <e7c>   DW_AT_decl_column : 20
    <e7d>   DW_AT_type        : <0xe18>
    <e81>   DW_AT_data_member_location: 84
 <2><e82>: Abbrev Number: 1 (DW_TAG_member)
    <e83>   DW_AT_name        : (indirect string, offset: 0xc09ba): head
    <e87>   DW_AT_decl_file   : 1
    <e88>   DW_AT_decl_line   : 47
    <e89>   DW_AT_decl_column : 6
    <e8a>   DW_AT_type        : <0x12d>
    <e8e>   DW_AT_data_member_location: 88
 <2><e8f>: Abbrev Number: 1 (DW_TAG_member)
    <e90>   DW_AT_name        : (indirect string, offset: 0xbf250): tail
    <e94>   DW_AT_decl_file   : 1
    <e95>   DW_AT_decl_line   : 48
    <e96>   DW_AT_decl_column : 6
    <e97>   DW_AT_type        : <0x12d>
    <e9b>   DW_AT_data_member_location: 92
 <2><e9c>: Abbrev Number: 0
 <1><e9d>: Abbrev Number: 26 (DW_TAG_array_type)
    <e9e>   DW_AT_type        : <0xe47>
    <ea2>   DW_AT_sibling     : <0xead>
 <2><ea6>: Abbrev Number: 27 (DW_TAG_subrange_type)
    <ea7>   DW_AT_type        : <0x134>
    <eab>   DW_AT_upper_bound : 9
 <2><eac>: Abbrev Number: 0
 <1><ead>: Abbrev Number: 4 (DW_TAG_typedef)
    <eae>   DW_AT_name        : (indirect string, offset: 0xbe171): ring_buffer
    <eb2>   DW_AT_decl_file   : 1
    <eb3>   DW_AT_decl_line   : 49
    <eb4>   DW_AT_decl_column : 2
    <eb5>   DW_AT_type        : <0xe53>
 <1><eb9>: Abbrev Number: 13 (DW_TAG_variable)
    <eba>   DW_AT_name        : (indirect string, offset: 0xbfdf0): huart2
    <ebe>   DW_AT_decl_file   : 1
    <ebe>   DW_AT_decl_line   : 66
    <ebf>   DW_AT_decl_column : 20
    <ec0>   DW_AT_type        : <0xacf>
    <ec4>   DW_AT_external    : 1
    <ec4>   DW_AT_location    : 5 byte block: 3 8c 0 0 20 	(DW_OP_addr: 2000008c)
 <1><eca>: Abbrev Number: 13 (DW_TAG_variable)
    <ecb>   DW_AT_name        : (indirect string, offset: 0xc1803): ConsumerTaskHandle
    <ecf>   DW_AT_decl_file   : 1
    <ecf>   DW_AT_decl_line   : 69
    <ed0>   DW_AT_decl_column : 14
    <ed1>   DW_AT_type        : <0xced>
    <ed5>   DW_AT_external    : 1
    <ed5>   DW_AT_location    : 5 byte block: 3 14 1 0 20 	(DW_OP_addr: 20000114)
 <1><edb>: Abbrev Number: 13 (DW_TAG_variable)
    <edc>   DW_AT_name        : (indirect string, offset: 0xc09a2): ConsumerTask_attributes
    <ee0>   DW_AT_decl_file   : 1
    <ee0>   DW_AT_decl_line   : 70
    <ee1>   DW_AT_decl_column : 22
    <ee2>   DW_AT_type        : <0xd9b>
    <ee6>   DW_AT_external    : 1
    <ee6>   DW_AT_location    : 5 byte block: 3 cc 73 0 8 	(DW_OP_addr: 80073cc)
 <1><eec>: Abbrev Number: 13 (DW_TAG_variable)
    <eed>   DW_AT_name        : (indirect string, offset: 0xbdc9d): myCountingSem01Handle
    <ef1>   DW_AT_decl_file   : 1
    <ef1>   DW_AT_decl_line   : 76
    <ef2>   DW_AT_decl_column : 17
    <ef3>   DW_AT_type        : <0xcf9>
    <ef7>   DW_AT_external    : 1
    <ef7>   DW_AT_location    : 5 byte block: 3 18 1 0 20 	(DW_OP_addr: 20000118)
 <1><efd>: Abbrev Number: 13 (DW_TAG_variable)
    <efe>   DW_AT_name        : (indirect string, offset: 0xc1579): myCountingSem01_attributes
    <f02>   DW_AT_decl_file   : 1
    <f02>   DW_AT_decl_line   : 77
    <f03>   DW_AT_decl_column : 25
    <f04>   DW_AT_type        : <0xded>
    <f08>   DW_AT_external    : 1
    <f08>   DW_AT_location    : 5 byte block: 3 f0 73 0 8 	(DW_OP_addr: 80073f0)
 <1><f0e>: Abbrev Number: 13 (DW_TAG_variable)
    <f0f>   DW_AT_name        : (indirect string, offset: 0xbea11): ProducerTaskHandle
    <f13>   DW_AT_decl_file   : 1
    <f13>   DW_AT_decl_line   : 81
    <f14>   DW_AT_decl_column : 14
    <f15>   DW_AT_type        : <0xced>
    <f19>   DW_AT_external    : 1
    <f19>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><f1f>: Abbrev Number: 13 (DW_TAG_variable)
    <f20>   DW_AT_name        : (indirect string, offset: 0xbf807): ProducerTask_attributes
    <f24>   DW_AT_decl_file   : 1
    <f24>   DW_AT_decl_line   : 82
    <f25>   DW_AT_decl_column : 22
    <f26>   DW_AT_type        : <0xd9b>
    <f2a>   DW_AT_external    : 1
    <f2a>   DW_AT_location    : 5 byte block: 3 0 74 0 8 	(DW_OP_addr: 8007400)
 <1><f30>: Abbrev Number: 20 (DW_TAG_variable)
    <f31>   DW_AT_name        : rb
    <f34>   DW_AT_decl_file   : 1
    <f34>   DW_AT_decl_line   : 89
    <f35>   DW_AT_decl_column : 20
    <f36>   DW_AT_type        : <0xead>
    <f3a>   DW_AT_location    : 5 byte block: 3 1c 1 0 20 	(DW_OP_addr: 2000011c)
 <1><f40>: Abbrev Number: 7 (DW_TAG_subprogram)
    <f41>   DW_AT_external    : 1
    <f41>   DW_AT_name        : (indirect string, offset: 0xc1da5): osDelay
    <f45>   DW_AT_decl_file   : 11
    <f46>   DW_AT_decl_line   : 459
    <f48>   DW_AT_decl_column : 12
    <f49>   DW_AT_prototyped  : 1
    <f49>   DW_AT_type        : <0xce1>
    <f4d>   DW_AT_declaration : 1
    <f4d>   DW_AT_sibling     : <0xf57>
 <2><f51>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <f52>   DW_AT_type        : <0x15d>
 <2><f56>: Abbrev Number: 0
 <1><f57>: Abbrev Number: 21 (DW_TAG_subprogram)
    <f58>   DW_AT_external    : 1
    <f58>   DW_AT_name        : (indirect string, offset: 0xbe157): osThreadGetId
    <f5c>   DW_AT_decl_file   : 11
    <f5d>   DW_AT_decl_line   : 358
    <f5f>   DW_AT_decl_column : 14
    <f60>   DW_AT_prototyped  : 1
    <f60>   DW_AT_type        : <0xced>
    <f64>   DW_AT_declaration : 1
 <1><f64>: Abbrev Number: 7 (DW_TAG_subprogram)
    <f65>   DW_AT_external    : 1
    <f65>   DW_AT_name        : (indirect string, offset: 0xbdb4c): HAL_UART_Init
    <f69>   DW_AT_decl_file   : 9
    <f6a>   DW_AT_decl_line   : 1670
    <f6c>   DW_AT_decl_column : 19
    <f6d>   DW_AT_prototyped  : 1
    <f6d>   DW_AT_type        : <0x51d>
    <f71>   DW_AT_declaration : 1
    <f71>   DW_AT_sibling     : <0xf7b>
 <2><f75>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <f76>   DW_AT_type        : <0xf7b>
 <2><f7a>: Abbrev Number: 0
 <1><f7b>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f7c>   DW_AT_byte_size   : 4
    <f7c>   DW_AT_type        : <0xacf>
 <1><f80>: Abbrev Number: 7 (DW_TAG_subprogram)
    <f81>   DW_AT_external    : 1
    <f81>   DW_AT_name        : (indirect string, offset: 0xc12aa): HAL_RCC_ClockConfig
    <f85>   DW_AT_decl_file   : 7
    <f86>   DW_AT_decl_line   : 4837
    <f88>   DW_AT_decl_column : 19
    <f89>   DW_AT_prototyped  : 1
    <f89>   DW_AT_type        : <0x51d>
    <f8d>   DW_AT_declaration : 1
    <f8d>   DW_AT_sibling     : <0xf9c>
 <2><f91>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <f92>   DW_AT_type        : <0xf9c>
 <2><f96>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <f97>   DW_AT_type        : <0x15d>
 <2><f9b>: Abbrev Number: 0
 <1><f9c>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <f9d>   DW_AT_byte_size   : 4
    <f9d>   DW_AT_type        : <0x6ae>
 <1><fa1>: Abbrev Number: 7 (DW_TAG_subprogram)
    <fa2>   DW_AT_external    : 1
    <fa2>   DW_AT_name        : (indirect string, offset: 0xc080b): HAL_RCC_OscConfig
    <fa6>   DW_AT_decl_file   : 7
    <fa7>   DW_AT_decl_line   : 4836
    <fa9>   DW_AT_decl_column : 19
    <faa>   DW_AT_prototyped  : 1
    <faa>   DW_AT_type        : <0x51d>
    <fae>   DW_AT_declaration : 1
    <fae>   DW_AT_sibling     : <0xfb8>
 <2><fb2>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <fb3>   DW_AT_type        : <0xfb8>
 <2><fb7>: Abbrev Number: 0
 <1><fb8>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <fb9>   DW_AT_byte_size   : 4
    <fb9>   DW_AT_type        : <0x658>
 <1><fbd>: Abbrev Number: 7 (DW_TAG_subprogram)
    <fbe>   DW_AT_external    : 1
    <fbe>   DW_AT_name        : (indirect string, offset: 0xc048a): HAL_PWREx_ControlVoltageScaling
    <fc2>   DW_AT_decl_file   : 14
    <fc3>   DW_AT_decl_line   : 837
    <fc5>   DW_AT_decl_column : 19
    <fc6>   DW_AT_prototyped  : 1
    <fc6>   DW_AT_type        : <0x51d>
    <fca>   DW_AT_declaration : 1
    <fca>   DW_AT_sibling     : <0xfd4>
 <2><fce>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <fcf>   DW_AT_type        : <0x15d>
 <2><fd3>: Abbrev Number: 0
 <1><fd4>: Abbrev Number: 21 (DW_TAG_subprogram)
    <fd5>   DW_AT_external    : 1
    <fd5>   DW_AT_name        : (indirect string, offset: 0xbe97f): osKernelStart
    <fd9>   DW_AT_decl_file   : 11
    <fda>   DW_AT_decl_line   : 302
    <fdc>   DW_AT_decl_column : 12
    <fdd>   DW_AT_prototyped  : 1
    <fdd>   DW_AT_type        : <0xce1>
    <fe1>   DW_AT_declaration : 1
 <1><fe1>: Abbrev Number: 7 (DW_TAG_subprogram)
    <fe2>   DW_AT_external    : 1
    <fe2>   DW_AT_name        : (indirect string, offset: 0xbde09): osThreadGetStackSpace
    <fe6>   DW_AT_decl_file   : 11
    <fe7>   DW_AT_decl_line   : 373
    <fe9>   DW_AT_decl_column : 10
    <fea>   DW_AT_prototyped  : 1
    <fea>   DW_AT_type        : <0x15d>
    <fee>   DW_AT_declaration : 1
    <fee>   DW_AT_sibling     : <0xff8>
 <2><ff2>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <ff3>   DW_AT_type        : <0xced>
 <2><ff7>: Abbrev Number: 0
 <1><ff8>: Abbrev Number: 7 (DW_TAG_subprogram)
    <ff9>   DW_AT_external    : 1
    <ff9>   DW_AT_name        : (indirect string, offset: 0xbff7a): osThreadNew
    <ffd>   DW_AT_decl_file   : 11
    <ffe>   DW_AT_decl_line   : 349
    <1000>   DW_AT_decl_column : 14
    <1001>   DW_AT_prototyped  : 1
    <1001>   DW_AT_type        : <0xced>
    <1005>   DW_AT_declaration : 1
    <1005>   DW_AT_sibling     : <0x1019>
 <2><1009>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <100a>   DW_AT_type        : <0xc97>
 <2><100e>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <100f>   DW_AT_type        : <0x81d>
 <2><1013>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1014>   DW_AT_type        : <0x1019>
 <2><1018>: Abbrev Number: 0
 <1><1019>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <101a>   DW_AT_byte_size   : 4
    <101a>   DW_AT_type        : <0xd9b>
 <1><101e>: Abbrev Number: 7 (DW_TAG_subprogram)
    <101f>   DW_AT_external    : 1
    <101f>   DW_AT_name        : (indirect string, offset: 0xc1844): osSemaphoreNew
    <1023>   DW_AT_decl_file   : 11
    <1024>   DW_AT_decl_line   : 588
    <1026>   DW_AT_decl_column : 17
    <1027>   DW_AT_prototyped  : 1
    <1027>   DW_AT_type        : <0xcf9>
    <102b>   DW_AT_declaration : 1
    <102b>   DW_AT_sibling     : <0x103f>
 <2><102f>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1030>   DW_AT_type        : <0x15d>
 <2><1034>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1035>   DW_AT_type        : <0x15d>
 <2><1039>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <103a>   DW_AT_type        : <0x103f>
 <2><103e>: Abbrev Number: 0
 <1><103f>: Abbrev Number: 6 (DW_TAG_pointer_type)
    <1040>   DW_AT_byte_size   : 4
    <1040>   DW_AT_type        : <0xded>
 <1><1044>: Abbrev Number: 7 (DW_TAG_subprogram)
    <1045>   DW_AT_external    : 1
    <1045>   DW_AT_name        : (indirect string, offset: 0xc0327): xQueueCreateCountingSemaphore
    <1049>   DW_AT_decl_file   : 12
    <104a>   DW_AT_decl_line   : 1416
    <104c>   DW_AT_decl_column : 15
    <104d>   DW_AT_prototyped  : 1
    <104d>   DW_AT_type        : <0xdfd>
    <1051>   DW_AT_declaration : 1
    <1051>   DW_AT_sibling     : <0x1060>
 <2><1055>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1056>   DW_AT_type        : <0xb0d>
 <2><105a>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <105b>   DW_AT_type        : <0xb0d>
 <2><105f>: Abbrev Number: 0
 <1><1060>: Abbrev Number: 7 (DW_TAG_subprogram)
    <1061>   DW_AT_external    : 1
    <1061>   DW_AT_name        : (indirect string, offset: 0xbdedf): xQueueCreateMutex
    <1065>   DW_AT_decl_file   : 12
    <1066>   DW_AT_decl_line   : 1414
    <1068>   DW_AT_decl_column : 15
    <1069>   DW_AT_prototyped  : 1
    <1069>   DW_AT_type        : <0xdfd>
    <106d>   DW_AT_declaration : 1
    <106d>   DW_AT_sibling     : <0x1077>
 <2><1071>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <1072>   DW_AT_type        : <0x147>
 <2><1076>: Abbrev Number: 0
 <1><1077>: Abbrev Number: 21 (DW_TAG_subprogram)
    <1078>   DW_AT_external    : 1
    <1078>   DW_AT_name        : (indirect string, offset: 0xbe4fc): osKernelInitialize
    <107c>   DW_AT_decl_file   : 11
    <107d>   DW_AT_decl_line   : 287
    <107f>   DW_AT_decl_column : 12
    <1080>   DW_AT_prototyped  : 1
    <1080>   DW_AT_type        : <0xce1>
    <1084>   DW_AT_declaration : 1
 <1><1084>: Abbrev Number: 21 (DW_TAG_subprogram)
    <1085>   DW_AT_external    : 1
    <1085>   DW_AT_name        : (indirect string, offset: 0xc1999): HAL_Init
    <1089>   DW_AT_decl_file   : 15
    <108a>   DW_AT_decl_line   : 636
    <108c>   DW_AT_decl_column : 19
    <108d>   DW_AT_prototyped  : 1
    <108d>   DW_AT_type        : <0x51d>
    <1091>   DW_AT_declaration : 1
 <1><1091>: Abbrev Number: 37 (DW_TAG_subprogram)
    <1092>   DW_AT_external    : 1
    <1092>   DW_AT_name        : (indirect string, offset: 0xbda4a): printf
    <1096>   DW_AT_decl_file   : 16
    <1097>   DW_AT_decl_line   : 210
    <1098>   DW_AT_decl_column : 5
    <1099>   DW_AT_prototyped  : 1
    <1099>   DW_AT_type        : <0x12d>
    <109d>   DW_AT_declaration : 1
    <109d>   DW_AT_sibling     : <0x10a8>
 <2><10a1>: Abbrev Number: 5 (DW_TAG_formal_parameter)
    <10a2>   DW_AT_type        : <0xb2a>
